{"articles": [{"date": "datetime.datetime(2019, 4, 15, 17, 47, 13, 806845)", "titles": ["Republicans Have Killed Herman Cain’s Fed Nomination. Now What About Stephen Moore’s?", "Last Call in Westeros", "Notre Dame Cathedral Is on Fire", "Climate Change Meets the U.S. Border Crisis", "Uber Reveals One of Its Big Vulnerabilities", "I Think I Enjoy Listening to My Neighbors’ Sex a Little Too Much", "You Have a Moral Obligation to Review Businesses on Yelp", "Women in Charge: Anna Allanbrook", "Has Anyone Told Donald Trump What He Just Ordered in Somalia?", "“100 Days of Success”", "Where Is the Night King?", "It’s More Obvious Than Ever What Republicans Want With Omar", "The Insane Things Hospitals Have to Do to Wipe Out Superbugs Like C. Auris", "I Found the Best Steak Knife, and Now I Love Cutting My Meat", "“Because Science” Won’t Persuade Anyone to Vaccinate Their Kids", "William Barr Has Summarized a Controversial Legal Document Before. It Didn’t Go Well.", "I Get a Thrill Out of Exposing My Breasts While Driving. Does My Fetish Go Too Far?", "You Have a Moral Obligation to Review Businesses on Yelp (Sometimes)", "The Future of Unions Is White-Collar", "Seven Things to Look for When Reading the Redacted Version", "Stem Cell Therapy Is Being Marketed to Autistic Kids. It Shouldn’t Be.", "Help! My Boyfriend Seems Unable—or Unwilling—to Express His Love for Me.", "John Oliver Goes After the Sackler Family With Help From a Famous TV Drug Dealer", "Barack Who? When Valerie Jarrett Interviewed Michelle Robinson in 1991, Her Whole Life Changed.", "Game of Thrones Recap: Where’s the Night King?", "Kim K Esq.", "Dear Care and Feeding: How Can I Get Kids to Stop Going On and On About Boring Stuff Without Being Mean?", "What Trump Should Have Passed Instead of The Tax Bill That Everyone Hates", "Help! My 19-Year-Old Daughter Ghosted Us.", "Young Republicans Want to Do Something About Climate Change", "Help! We Can’t Afford Our Wedding Anymore. Should We Disinvite Guests?", "The Premiere Prepares for the End", "The Angle: Why Is Everyone Waiting for the Mueller Report?", "How to Scan Your Airbnb for Hidden Cameras", "How Food52 Uses Customer Insights to Design Products and Recipes", "The Art of Romance", "How Southern Baptists Are Grappling With Artificial Intelligence", "I Get a Thrill Out of Exposing My Breasts While Driving. Is That Wrong?", "Should we just cancel the wedding and elope?", "Phoebe Waller-Bridge Is Helping Daniel Craig Fix the New James Bond Script", "Dear Prudence Uncensored: The Manual-Labor Vacation", "The Supreme Court Divides Into Prudes and Cool Kids as the Justices Debate Naughty Trademarks", "Help! My Parents Demand My Husband and I Do Hard Labor Every Time We Visit.", "This Week’s Worst Person in Westeros: Jon Snow", "What Happened While We Were Waiting for the Mueller Report", "Here’s What It’s Like to Make Food Look Good on Screen", "Game of Thrones TV Club: Return to Winterfell", "There’s a New Divide Among the Supreme Court Justices: Prudes and Cool Kids", "The Best Umbrella Is a Lopsided Dutch Umbrella", "Natalie Jaresko on the Global Economy", "Barr Has Summarized a Controversial Legal Document Before. It Didn’t Go Well.", "How Strong Is the Government’s Case Against Assange?"]}, {"date": "datetime.datetime(2019, 4, 16, 10, 17, 54, 839360)", "titles": ["Two Explorations of Parenthood Win Slate’s Cartoonist Studio Prize", "The Best Umbrella Is a Lopsided Dutch Umbrella", "Why Nancy Pelosi Keeps Downplaying the Influence of AOC, Ilhan Omar, and Rashida Tlaib", "How can I get him to understand that he’s making me sick?", "How Bad Is Aunt Incest, Really?", "What Trump Should Have Passed Instead of the Tax Bill That Everyone Hates", "The Stormy Story of Three Kings, the Only Great Movie About the Gulf War", "What’s Been Saved and What’s Been Lost in the Fire", "The Only Great Gulf War Movie Almost Never Happened", "Phoebe Waller-Bridge Is Helping Daniel Craig Fix the New James Bond Script", "Here’s What It’s Like to Make Food Look Good on Screen", "Brands’ Most Desperate Attempts to Cash In on the End of Game of Thrones, Ranked", "I Think I Enjoy Listening to My Neighbors’ Sex a Little Too Much", "What Happens if the Fed Starts Looking More Like the Supreme Court, Swinging With Each New Appointment?", "The Art of Movement and Challenging Bodies: Merce Cunningham at 100", "Brands’ Most Desperate Attempts to Cash In, Ranked", "Help! My 19-Year-Old Daughter Ghosted Us.", "Bring MySpace-Esque Fonts and Colors Back to the Internet!", "How to Scan Your Airbnb for Hidden Cameras", "Young Republicans Want to Do Something About Climate Change", "What Trump Should Have Passed Instead of The Tax Bill That Everyone Hates", "Republicans Have Killed Herman Cain’s Fed Nomination. Now What About Stephen Moore’s?", "How Food52 Uses Customer Insights to Design Products and Recipes", "The Worst Baseball Contract Ever Is … a Very, Very Bad Contract", "Farmers Have Been Losing Money for Five Years Running. Which 2020 Candidate Has Their Back?", "What’s Been Saved and What’s Been Lost in the Notre Dame Fire", "I’m an SPF Obsessive and This $15 Sunscreen Is the Best I’ve Ever Tried", "First GOP Candidate Announces Primary Challenge to President Donald Trump", "Help! My Parents Demand My Husband and I Do Hard Labor Every Time We Visit.", "Donald Trump’s Ilhan Omar Tweet Might Be the Worst Tweet in History", "The Insane Things Hospitals Have to Do to Wipe Out Superbugs Like C. Auris", "Women in Charge: Anna Allanbrook", "Game of Thrones Raises the Question: How Bad Is Aunt Incest, Really?", "Trump’s Ilhan Omar Tweet Might Be the Worst Tweet in History", "Dear Prudence Uncensored: The Manual-Labor Vacation", "“Because Science” Won’t Persuade Anyone to Vaccinate Their Kids", "ICE Reportedly Deported Spouse of Army Solider Killed in Afghanistan, Leaving Their Daughter Parentless", "“100 Days of Success”", "Dear Care and Feeding: How Can I Get Kids to Stop Going On and On About Boring Stuff Without Being Mean?", "Help! We Can’t Afford Our Wedding Anymore. Should We Disinvite Guests?", "What’s So Refreshing About This Old-Fashioned New Novel", "Kim K Esq.", "A Piece of Paris Goes Up in Flames", "The Only Good Thing Left About the Show Is Its Fan Theories", "How Southern Baptists Are Grappling With Artificial Intelligence", "The Future of Unions Is White-Collar", "The Only Good Thing Left About Game of Thrones Is Its Fan Theories", "There’s a New Divide Among the Justices: Prudes and Cool Kids", "Help! My Husband Uses Our Silverware to Feed Our Dog, and It’s Making Me Sick.", "This Week’s Worst Person in Westeros: Jon Snow", "My Sexually Generous Boyfriend Totally Avoids Me During My Period. Is This a Deal Breaker?", "You Have a Moral Obligation to Review Businesses on Yelp (Sometimes)", "Natalie Jaresko on the Global Economy", "How Can I Miss Star Wars When It Won’t Go Away?"]}, {"date": "datetime.datetime(2019, 4, 17, 11, 28, 14, 980531)", "titles": ["Our Favorite Air Purifiers Are on Sale, Just in Time for Allergy Season", "Notre Dame Is Still a Living Monument", "Trump Administration to Allow for Extended Detention of Certain Asylum Seekers as Deterrent to Others Not to Come", "What’s Fact and What’s Fiction in Fosse/Verdon, Episode 2", "Learn About Australia’s Most Dangerous Animals With Conan O’Brien", "Kim K Esq.", "How can I get him to understand that he’s making me sick?", "“100 Days of Success”", "Stop Losing Your Coat!!", "Desert Storm", "Teen Spirit and Her Smell Elevate the Power of Pop Performance", "Dear Care and Feeding: How Do I Get My Kid to Stop Losing His Coat?!", "Here’s What It’s Like to Make Food Look Good on Screen", "Young Republicans Want to Do Something About Climate Change", "Some of the 2020 Democrats Should Be Giving Much More to Charity", "The Only Good Thing Left About the Show", "My Sexually Generous Boyfriend Totally Avoids Me During My Period. Is This a Deal Breaker?", "India Is Leading the World in Internet Shutdowns", "Brands’ Most Desperate Attempts to Cash In on the End, Ranked", "Dear Prudence Uncensored: The Manual-Labor Vacation", "How Katie Bouman Shook Wikipedia", "“Because Science” Won’t Persuade Anyone to Vaccinate Their Kids", "Some of the 2020 Dems Should Really Be Giving a Lot More to Charity", "Women in Charge: Anna Allanbrook", "Is Brooklyn’s Gun Court Getting Weapons off the Streets—or Just Locking Up More Young Black Men?", "What One American Muslim Feels Watching Rep. Ilhan Omar", "How Food52 Uses Customer Insights to Design Products and Recipes", "Help! My 19-Year-Old Daughter Ghosted Us.", "Bring MySpace-Like Fonts and Colors Back to the Web", "A Piece of Paris Goes Up in Flames", "Help! We Can’t Afford Our Wedding Anymore. Should We Disinvite Guests?", "How Bad Is Aunt Incest, Really?", "Trump Thinks Migrants Are a Political Weapon", "“Notre Dame Is a Living Building”", "What’s Fact and What’s Fiction in Fosse/Verdon Episode 2", "How Do I Minimize My Preschooler’s Exposure to Sugar?", "The Best College Gymnast in America Is Also the Most Hated", "Bring MySpace-Esque Fonts and Colors Back to the Internet!", "The Only Good Thing Left About Game of Thrones Is Its Fan Theories", "The Lingua Francas", "What Trump Should Have Passed Instead of The Tax Bill That Everyone Hates", "Natalie Jaresko on the Global Economy", "Mayor Pete’s Court Packing Plan Is Unconstitutional", "Russell Crowe Transforms Into Roger Ailes in the Teaser for Showtime’s The Loudest Voice", "For Many Queers, Coming Out Requires Going Out. But What if Chronic Illness Makes That Impossible?", "Be Afraid! Your Dear Mother Is Not Off Limits To New York Times Reporters And Their Meddlesome Questions.", "You Have a Moral Obligation to Review Businesses on Yelp (Sometimes)", "Dear Prudence Podcast: Help! My Friend Treats Me Like an Unpaid Therapist.", "How to Scan Your Airbnb for Hidden Cameras", "The Guantánamo Military Commission Has Been Handed a Stunning Rebuke", "Congress Invoked the War Powers Act to Try to Rein in Trump. He Just Vetoed It.", "The Making of Charged", "The Future of Unions Is White-Collar"]}, {"date": "datetime.datetime(2019, 4, 18, 9, 55, 5, 906969)", "titles": ["Ethics Alone Can’t Fix Big Tech", "Police Are Making Tone-Deaf Memes to Build Community Trust", "Dear Prudence Podcast: Help! My Friend Treats Me Like an Unpaid Therapist.", "Don’t Rebuild It. There’s No Restoring What’s Been Lost.", "Help! My Wife and I Agreed I Would Get Pregnant With Our Next Kid, but Now I Don’t Want To.", "We Just Named a Blind Amphibian After Donald Trump. Should We Have?", "Some of the 2020 Dems Should Really Be Giving a Lot More to Charity", "Kim K Esq.", "The Release of the Mueller Report Already Seems Like a Coverup", "The Future of Unions Is White-Collar", "Dear Prudence Uncensored: The Flirtatious Neighbor", "A Homophobic Student Regularly Calls Me Anti-Gay Slurs. Should I Confront Him?", "Notre Dame Is Still a Living Monument", "I Won’t Feel Bad About Sensationalizing While Speed-Reading This", "Sometimes It Takes a Horrible Fire to Raise a Billion Dollars", "The Release of the Report Already Seems Like a Cover-Up", "Watch William Barr’s Mueller Report Press Conference Live", "What Trump Should Have Passed Instead of The Tax Bill That Everyone Hates", "Beyoncé’s Surprise Coachella Album Includes Two New Tracks", "India Is Leading the World in Internet Shutdowns", "Herman Cain Says He Is Not Actually Withdrawing His Name From the Fed Race", "A Piece of Paris Goes Up in Flames", "The Courts and Canada Are Doing What the U.S. Government Won’t on Data Breaches", "I don’t want to break our promise, but I can’t see how giving up the good life we have is worth it.", "North Korea Says It Just Conducted a Weapons Test. Is This the End of Trump-Kim Love-a-thon?", "This Was the Most Exciting Soccer Match of the Year", "Mueller Report Live Blog: I Guess We’re Going to Start With William Barr Giving His Version of Events Again", "Until Recently, I’d Never Seen Another Black Hunter Depicted in Pop Culture. When I Finally Did, It Hit Very Close to Home.", "This One Question Always Trips Up Pro-Choice Politicians", "How to Scan Your Airbnb for Hidden Cameras", "My Sexually Generous Boyfriend Totally Avoids Me During My Period. Is This a Deal Breaker?", "What Happened to Winter on Game of Thrones?", "I Hoard These Heel-Saving Bandages I Found in France", "Future Tense Newsletter: A Theory of Conspiracy", "Desert Storm", "The New Interior Secretary Means Business. Big Business.", "The Urgency to Repair the Cathedral Should’ve Existed Before the Fire", "Meghan and Harry’s Decision Not to Dangle Their Newborn Before the Press Is the Natural Next Step in Their Self-Branding", "When the Spire Falls", "One Question Always Trips Up Pro-Choice Politicians. Allow Me to Help.", "William Barr Has Trashed His Own Justice Department to Try to Save Trump", "Even Instant Replay Couldn’t Ruin the Most Exciting Soccer Match of the Year", "The Best College Gymnast in America Is Also the Most Hated", "Help! I’m Sober Now, but Regret and Shame Keep Preventing Me From Moving Forward.", "Making Sense of WikiLeaks Founder Julian Assange", "Mueller Report Live Blog: Barr Is Just Repeating What He Said in His March Letter", "Help! My Husband Uses Our Silverware to Feed Our Dog, and It’s Making Me Sick.", "Should You Work Out in a Freezing Cold Gym?", "How Food52 Uses Customer Insights to Design Products and Recipes", "Watch Barr’s Mueller Report Press Conference Live", "“100 Days of Success”", "Dear Care and Feeding: How Do I Get My Kid to Stop Losing His Coat?!", "Women in Charge: Anna Allanbrook", "Ask a Teacher: I’m a Gay Man, and My Student Is Homophobic. What Should I Do?", "Learn About Australia’s Most Dangerous Animals With Conan O’Brien"]}, {"date": "datetime.datetime(2019, 4, 18, 23, 38, 39, 845749)", "titles": ["This Was the Most Exciting Soccer Match of the Year", "I Want to Buy My Dying Mom One Last Night With a Stud. Should I Tell Her I Paid Him?", "My Dog Is Hopelessly Camera-Shy. How Can I Make Him Less Scared of the Spotlight?", "Trump’s Response to the Mueller Report Dropping Has Basically Been to Tweet Out Fox News Quotes", "Herman Cain Says He Is Not Actually Withdrawing His Name From the Fed Race", "Is the Mueller Report Damning Enough to Be the Centerpiece of a 2020 Campaign?", "A Piece of Paris Goes Up in Flames", "What Mueller Says About Jared Kushner and Ivanka Trump", "This One Question Always Trips Up Pro-Choice Politicians", "Desert Storm", "All the Mistakes Mueller Made in Declining to Prosecute Don Jr.", "What Trump Should Have Passed Instead of The Tax Bill That Everyone Hates", "Is the Mueller Report Damning Enough to Shape the 2020 Race?", "Trump Is Tweeting Game of Thrones Memes Again, to HBO’s Displeasure", "Police Are Making Tone-Deaf Memes to Build Community Trust", "What the Mueller Report Says About James Comey’s Firing", "William Barr Has Failed America", "The Key to the Most Flavorful Braised Chicken on the Block", "The Courts and Canada Are Doing What the U.S. Government Won’t on Data Breaches", "Kevin Durant Knows Exactly How Patrick Beverley Plans to Troll Him", "I don’t want to break our promise, but I can’t see how giving up the good life we have is worth it.", "Mueller’s Report Proves Trump Obstructed Justice—and Asks Congress to Consider Impeachment", "We Learned New Ways Russia Trolled Americans in Real Life", "I’d Never Seen Another Black Hunter Depicted in Pop Culture", "The Mueller Report Shows Just How Much Russia Trolled Americans in Real Life, Too", "I’m a Gay Man, and My Student Is Homophobic. What Should I Do?", "What About the Pee Tape?", "Making Sense of WikiLeaks Founder Julian Assange", "The Most Deeply Strange Details in the Mueller Report", "Patrick Beverley Tries to Get Inside Kevin Durant’s Head, Finds Durant Is Already There", "Pornhub’s New Horny Bee Campaign Is Part of a Well-Established Cultural Tradition", "Top Democrats Have a Clear Path to the One Thing They Don’t Want", "This Is Not the Mueller Report. This Is a Segment Called “Can Millennials Open a Can of Paint?”", "Shepard Smith Delivered the Best Burn I Heard All Day", "Until Recently, I’d Never Seen Another Black Hunter Depicted in Pop Culture. When I Finally Did, It Hit Very Close to Home.", "How Food52 Uses Customer Insights to Design Products and Recipes", "Help! My Husband Uses Our Silverware to Feed Our Dog, and It’s Making Me Sick.", "Missed Everything? Here’s All You Should Know.", "Everything You Should Know About the Mueller Report", "Help! I’m Sober Now, but Regret and Shame Keep Preventing Me From Moving Forward.", "Playwright Suzan-Lori Parks’ Experiment in Empathy: White Noise", "Why Was the Mueller Report Delivered to Congress on CDs?", "I Hoard These Heel-Saving Bandages I Found in France", "Barr Must Resign", "Katie Bouman and the Myth of the Lone Genius", "Sometimes It Takes a Horrible Fire to Raise a Billion Dollars", "Trump’s Response Has Just Been to Tweet Fox News Quotes", "On Slate’s Parenting Podcast: How Do I Stop Relatives Posting Pictures of My Kid on Social Media?", "Women in Charge: Anna Allanbrook", "William Barr Has Trashed His Own Justice Department to Try to Save Trump", "How to Scan Your Airbnb for Hidden Cameras", "New Details From the Mueller Report About Don Jr.’s Interactions With WikiLeaks", "Future Tense Newsletter: A Theory of Conspiracy", "The Future of Unions Is White-Collar", "Dear Prudence Podcast: Help! My Friend Treats Me Like an Unpaid Therapist.", "“100 Days of Success”", "Meghan and Harry’s Self-Branding Game Is Starting to Look More Like Beyoncé’s", "Dear Prudence Uncensored: The Flirtatious Neighbor", "Robert Mueller’s Biographer Sees a Bombshell on (Nearly) Every Page of the Redacted Mueller Report", "The Mueller Report Is a Portrait of an Egomaniac Who Nobody Likes", "Kim K Esq.", "Here Are the Report’s Most Deeply Strange Details", "Some of the 2020 Dems Should Really Be Giving a Lot More to Charity"]}, {"date": "datetime.datetime(2019, 4, 20, 1, 40, 9, 625424)", "titles": ["The Mueller Report Shows Just How Much Russia Trolled Americans in Real Life, Too", "When Did Slasher Movies Get So Respectable?", "How to Scan Your Airbnb for Hidden Cameras", "Think You’re Smarter Than Slate’s Future Tense Editor?", "New Details From the Mueller Report About Don Jr.’s Interactions With WikiLeaks", "Dear Prudence Uncensored: The Flirtatious Neighbor", "Dear Care and Feeding: Who the Heck Is Patrick?", "A Piece of Paris Goes Up in Flames", "Why Was the Mueller Report Delivered to Congress on CDs?", "Herman Cain Says He Is Not Actually Withdrawing His Name From the Fed Race", "Help! My Husband Uses Our Silverware to Feed Our Dog, and It’s Making Me Sick.", "There Won’t Be Any Expeditions to the North Pole This Year", "The Mueller Report Is an Irrefutable Case That Trump Is Unfit for Office", "Attempted Obstruction of Justice Is Still a Crime", "What Trump Should Have Passed Instead of The Tax Bill That Everyone Hates", "Sometimes It Takes a Horrible Fire to Raise a Billion Dollars", "The Rich, Haunting History of “In the Pines” Predates Nirvana’s MTV Unplugged", "The Haunting Power of “In the Pines”", "Why There Won’t Be Any Expeditions to the North Pole This Year", "A Pulled Ancestry.com Ad on Interracial Love During Slavery Sells a Rosy View of Racial History", "Why Elizabeth Warren Wants the House to Start Impeachment Proceedings", "Dahlia Lithwick Lets a Former DOJ Spokesman Explain How “Disgraceful” Barr’s Presser Was", "Jeopardy!’s Latest Champion Isn’t Just Winning the Game. He’s Changing It.", "A Right-Wing Militia Has Allegedly Been Holding Migrant Families at Gunpoint", "Why Elizabeth Warren Wants the House to Start Impeachment Proceedings Against Trump", "Rabbit Holes: If “Listening to Your Body” Is the Highest Virtue on Wellness Instagram, I’m a Saint", "Help! I’m Sober Now, but Regret and Shame Keep Preventing Me From Moving Forward.", "Making Sense of WikiLeaks Founder Julian Assange", "This $13, Olive-Derived Oil Gave Me the Best Skin of My Life", "Kim K Esq.", "Donald Trump’s Personality Is an Impeachable Offense", "Dear Prudence Podcast: Help! My Friend Treats Me Like an Unpaid Therapist.", "I Want to Buy My Dying Mom One Last Night With a Stud. Should I Tell Her I Paid?", "Under the Silver Lake Is a Total Mess and Totally Worth It", "Slate Spoiler Specials: After", "Work Till You Die", "The One Death Game of Thrones Can’t Face", "The Other Thing the Mueller Report Proved: Journalists Were Right", "Don McGahn Not Listening to Donald Trump Doesn’t Absolve the President of a Crime", "Police Are Making Tone-Deaf Memes to Build Community Trust", "Fox News’ Shepard Smith Delivered the Best Burn I Heard All Day", "How a Futurist Sees AOC’s Video “A Message From the Future”", "Some of the 2020 Dems Should Really Be Giving a Lot More to Charity", "Who the Heck Is Patrick?", "Why Must Hollywood Deny Us the Pleasure of Seeing Lori Loughlin’s Latest Projects?", "Mueller’s Biographer on the Report’s Most “Remarkable” Scene", "Getting Good at Being Wrong: Stacey Abrams on Why It’s OK to Make Mistakes", "People Are Already Scheming to Take Theresa May’s Job", "Women in Charge: Anna Allanbrook", "“100 Days of Success”", "The International Hilarity of Loyiso Gola", "The Future of Unions Is White-Collar", "Mueller’s Report Proves Trump Obstructed Justice—and Asks Congress to Consider Impeachment", "I Want to Buy My Dying Mom One Last Night With a Stud. Should I Tell Her I Paid Him?", "How Food52 Uses Customer Insights to Design Products and Recipes", "The Angle: Mueller Gave Us the Report. Now What Are We Going to Do About It?", "Mueller Cited Scalia to Prove Trump’s Official Acts Might Have Been Obstruction", "I don’t want to break our promise, but I can’t see how giving up the good life we have is worth it.", "The Political Gabfest Wonders What This Means for Impeachment", "The Serena Williams of Jeopardy!"]}, {"date": "datetime.datetime(2019, 4, 20, 14, 6, 2, 450647)", "titles": ["Why There Won’t Be Any Expeditions to the North Pole This Year", "Help! My Husband Uses Our Silverware to Feed Our Dog, and It’s Making Me Sick.", "So Is Impeachment Plausible, Necessary, or Stupid?", "Getting Good at Being Wrong: Stacey Abrams on Why It’s OK to Make Mistakes", "If “Listening to Your Body” Is the Highest Virtue on Wellness Instagram, I’m a Saint", "Dear Care and Feeding: Who the Heck Is Patrick?", "New Details From the Mueller Report About Don Jr.’s Interactions With WikiLeaks", "The Haunting Power of “In the Pines”", "The Inspecting Our Own Meat Edition", "Help! My Sister and I Planned to Share a Wedding Dress. Now She Hates It and Wants Me to Pay for It.", "Under the Silver Lake Is a Total Mess", "The Other Thing the Mueller Report Proved: Journalists Were Right", "Jeopardy!’s Latest Champion Isn’t Just Winning the Game. He’s Changing It.", "My Dog Is Hopelessly Camera-Shy. How Can I Make Him Less Scared of the Spotlight?", "Why Elizabeth Warren Wants the House to Start Impeachment Proceedings Against Trump", "Why Must Hollywood Deny Us the Pleasure of Seeing Lori Loughlin’s Latest Projects?", "What Trump Should Have Passed Instead of The Tax Bill That Everyone Hates", "How to Get Rid of (and Prevent) Red Wine Stains on Your Teeth, According to Dentists", "“100 Days of Success”", "Under the Silver Lake Is a Total Mess and Totally Worth It", "A Pulled Ancestry.com Ad on Interracial Love During Slavery Sells a Rosy View of Racial History", "This $13, Olive-Derived Oil Gave Me the Best Skin of My Life", "Herman Cain Says He Is Not Actually Withdrawing His Name From the Fed Race", "How a Futurist Sees AOC’s Vision of the Future", "Ancestry.com’s Ad on Interracial Love During Slavery Sold a Rosy View of Racial History", "Police Are Making Tone-Deaf Memes to Build Community Trust", "Why Warren Wants the House to Start Impeachment Proceedings", "Immigrants Can Be Denied Citizenship for Working in Legal Marijuana Industry", "I got a text from her telling me I owe her hundreds of dollars because she hates the dress and deserves a new one.", "Work Till You Die", "Who Wants to Be Britain’s Next Prime Minister?", "The Future of Unions Is White-Collar", "Help! I’m Sober Now, but Regret and Shame Keep Preventing Me From Moving Forward.", "Dear Prudence Podcast: Help! My Friend Treats Me Like an Unpaid Therapist.", "The One Death Game of Thrones Can’t Face", "Some of the 2020 Dems Should Really Be Giving a Lot More to Charity", "Why Was the Mueller Report Delivered to Congress on CDs?", "Hope Hicks Says Hope Hicks Was Great at Her Job. Should We Trust Her?", "My Sister Wants Me to Pay for Our Wedding Dress", "Kim K Esq.", "Sometimes It Takes a Horrible Fire to Raise a Billion Dollars", "How a Futurist Sees AOC’s Video “A Message From the Future”", "Women in Charge: Anna Allanbrook", "The International Hilarity of Loyiso Gola", "The Mueller Report Is an Irrefutable Case That Trump Is Unfit for Office", "When Did Slasher Movies Get So Respectable?", "A Piece of Paris Goes Up in Flames", "How to Scan Your Airbnb for Hidden Cameras", "Rabbit Holes: If “Listening to Your Body” Is the Highest Virtue on Wellness Instagram, I’m a Saint", "The Mueller Report Shows Just How Much Russia Trolled Americans in Real Life, Too", "Dear Prudence Uncensored: The Flirtatious Neighbor", "Is Joe Biden Better in Theory or Practice?", "The Indica vs. Sativa Distinction Isn’t Real", "The Breakout Star of the Mueller Report?"]}, {"date": "datetime.datetime(2019,4, 22, 13, 2, 0,215419)", "titles": ["Why There Won’t Be Any Expeditions to the North Pole This Year", "The Mueller Report Shows Just How Much Russia Trolled Americans in Real Life, Too", "A Piece of Paris Goes Up in Flames", "The Indica vs. Sativa Distinction Isn’t Real", "So Is Impeachment Plausible, Necessary, or Stupid?", "Quiz: Can You Match These Celebrity Donors With the Primary Candidate They’re Supporting?", "This Easter, Read Dorothy Parker Viciously Roasting Everyone Else’s Hacky Easter Jokes", "Comedian Known for Playing President on TV Easily Wins Ukraine’s Presidential Election", "Some of the 2020 Dems Should Really Be Giving a Lot More to Charity", "I’m a Gay Man, and My Student Is Homophobic. What Should I Do?", "Dear Care and Feeding: My 6-Year-Old Lies All the Time", "Help! I’m Sober Now, but Regret and Shame Keep Preventing Me From Moving Forward.", "My 6-Year-Old Lies All the Time", "This Week’s Worst Person in Westeros: The Racist Girls of Winterfell", "Even Space Isn’t Safe From Ads", "Gentleman Jack Tells the Story of “the First Modern Lesbian”", "Should I Tell My Friend the Man Pursuing Him Is HIV-Positive—and Hiding It?", "I Found an Even Better Butter-Spreading Knife", "Stephen Colbert Pays a Heartwarming Tribute to Recently Deceased Late Show and Colbert Report Cameraman John Meiklejohn", "How to Scan Your Airbnb for Hidden Cameras", "Herman Cain Says He Is Not Actually Withdrawing His Name From the Fed Race", "John Oliver Recaps the Juiciest, Most Profane Bits From the Mueller Report", "Should I Tell My Friend That the Man Pursuing Him Is Hiding That He’s HIV-Positive?", "How to Get Rid of (and Prevent) Red Wine Stains on Your Teeth, According to Dentists", "Trump Tweets That Millions Died in Sri Lanka and It Stays Up for 20 Minutes", "What Trump Should Have Passed Instead of The Tax Bill That Everyone Hates", "My Dog Is Hopelessly Camera-Shy. How Can I Make Him Less Scared of the Spotlight?", "James Holzhauer Could Be the Serena Williams of Jeopardy!", "I got a text from her telling me I owe her hundreds of dollars because she hates the dress and deserves a new one.", "The Mueller Report Makes It Clear: Trump Is Off the Hook in SDNY as Well", "Help! My Wife and I Agreed I Would Get Pregnant With Our Next Kid, but Now I Don’t Want To.", "When You Give Birth, Your Body … Rips. That Might Suck a Little Less if We Talked About It More.", "Florida Officer Under Investigation After Video Shows Him Punching, Slamming Black Teen’s Head Into Ground", "Trump Tweet Claiming Millions Killed in Sri Lanka Bombings Stays Up for 20 Minutes", "Why Does It Always Take a Crisis to Get Something Fixed?", "How Does It Feel to Be the First Black Woman to Lead the Harvard Crimson?", "Gay Culture Sure Is Trying to Make Jocks With Glasses Into Geeks", "Help! My Sister and I Planned to Share a Wedding Dress. Now She Hates It and Wants Me to Pay for It.", "The Failures of Rod Rosenstein", "New Details From the Mueller Report About Don Jr.’s Interactions With WikiLeaks", "Women in Charge: Anna Allanbrook", "Where Rod Rosenstein Failed", "How a Futurist Sees AOC’s Video “A Message From the Future”", "A Pulled Ancestry.com Ad on Interracial Love During Slavery Sells a Rosy View of Racial History", "The Inspecting Our Own Meat Edition", "North Carolina Man Accused of Shooting Two Children in Road Rage Incident", "Stop Saying We Have 12 Years Left to Address Climate Change", "In 1922, Dorothy Parker Roasted Everyone’s Hacky Easter Jokes", "Dear Prudence Podcast: Help! My Friend Treats Me Like an Unpaid Therapist.", "What Are House Democratic Leaders So Scared Of?", "Dear Prudence Uncensored: The Flirtatious Neighbor", "Unpacking Sally Rooney’s 19th-Century Influences"]}, {"date": "datetime.datetime(2019,4, 21, 13, 2, 0,215419)", "titles": ["Why There Won’t Be Any Expeditions to the North Pole This Year", "The Mueller Report Shows Just How Much Russia Trolled Americans in Real Life, Too", "A Piece of Paris Goes Up in Flames", "The Indica vs. Sativa Distinction Isn’t Real", "So Is Impeachment Plausible, Necessary, or Stupid?", "Quiz: Can You Match These Celebrity Donors With the Primary Candidate They’re Supporting?", "This Easter, Read Dorothy Parker Viciously Roasting Everyone Else’s Hacky Easter Jokes", "Comedian Known for Playing President on TV Easily Wins Ukraine’s Presidential Election", "Some of the 2020 Dems Should Really Be Giving a Lot More to Charity", "I’m a Gay Man, and My Student Is Homophobic. What Should I Do?", "Dear Care and Feeding: My 6-Year-Old Lies All the Time", "Help! I’m Sober Now, but Regret and Shame Keep Preventing Me From Moving Forward.", "My 6-Year-Old Lies All the Time", "This Week’s Worst Person in Westeros: The Racist Girls of Winterfell", "Even Space Isn’t Safe From Ads", "Gentleman Jack Tells the Story of “the First Modern Lesbian”", "Should I Tell My Friend the Man Pursuing Him Is HIV-Positive—and Hiding It?", "I Found an Even Better Butter-Spreading Knife", "Stephen Colbert Pays a Heartwarming Tribute to Recently Deceased Late Show and Colbert Report Cameraman John Meiklejohn", "How to Scan Your Airbnb for Hidden Cameras", "Herman Cain Says He Is Not Actually Withdrawing His Name From the Fed Race", "John Oliver Recaps the Juiciest, Most Profane Bits From the Mueller Report", "Should I Tell My Friend That the Man Pursuing Him Is Hiding That He’s HIV-Positive?", "How to Get Rid of (and Prevent) Red Wine Stains on Your Teeth, According to Dentists", "Trump Tweets That Millions Died in Sri Lanka and It Stays Up for 20 Minutes", "What Trump Should Have Passed Instead of The Tax Bill That Everyone Hates", "My Dog Is Hopelessly Camera-Shy. How Can I Make Him Less Scared of the Spotlight?", "James Holzhauer Could Be the Serena Williams of Jeopardy!", "I got a text from her telling me I owe her hundreds of dollars because she hates the dress and deserves a new one.", "The Mueller Report Makes It Clear: Trump Is Off the Hook in SDNY as Well", "Help! My Wife and I Agreed I Would Get Pregnant With Our Next Kid, but Now I Don’t Want To.", "When You Give Birth, Your Body … Rips. That Might Suck a Little Less if We Talked About It More.", "Florida Officer Under Investigation After Video Shows Him Punching, Slamming Black Teen’s Head Into Ground", "Trump Tweet Claiming Millions Killed in Sri Lanka Bombings Stays Up for 20 Minutes", "Why Does It Always Take a Crisis to Get Something Fixed?", "How Does It Feel to Be the First Black Woman to Lead the Harvard Crimson?", "Gay Culture Sure Is Trying to Make Jocks With Glasses Into Geeks", "Help! My Sister and I Planned to Share a Wedding Dress. Now She Hates It and Wants Me to Pay for It.", "The Failures of Rod Rosenstein", "New Details From the Mueller Report About Don Jr.’s Interactions With WikiLeaks", "Women in Charge: Anna Allanbrook", "Where Rod Rosenstein Failed", "How a Futurist Sees AOC’s Video “A Message From the Future”", "A Pulled Ancestry.com Ad on Interracial Love During Slavery Sells a Rosy View of Racial History", "The Inspecting Our Own Meat Edition", "North Carolina Man Accused of Shooting Two Children in Road Rage Incident", "Stop Saying We Have 12 Years Left to Address Climate Change", "In 1922, Dorothy Parker Roasted Everyone’s Hacky Easter Jokes", "Dear Prudence Podcast: Help! My Friend Treats Me Like an Unpaid Therapist.", "What Are House Democratic Leaders So Scared Of?", "Dear Prudence Uncensored: The Flirtatious Neighbor", "Unpacking Sally Rooney’s 19th-Century Influences"]}, {"date": "datetime.datetime(2019, 4, 23, 13, 2, 8, 458572)", "titles": ["Why Conservatives Are So Angry About Obama Saying “Easter Worshippers”", "How John Roberts Is Shaping the Supreme Court’s Newly Savage Death Penalty Jurisprudence", "Herman Cain Says He Decided to Pull Out of the Fed Race Because It Would Be a Pay Cut. LOL.", "The Best French Pantry Essentials, According to French Chefs", "Patrick Beverley, Jared Dudley, and the Art of Being an NBA Pest", "I Think of Truly, Truly Terrible Things to Climax During Sex", "The Straight Story", "Congress Subpoenas Don McGahn", "Years Ago, Black Feminists Worked Together to Unmask Twitter Trolls Posing as Women of Color. If Only More People Paid Attention.", "Even Space Isn’t Safe From Ads", "Anti-Immigrant Armed Militias Posted Videos and Fundraised Through Facebook for Months", "Leader Allegedly Said Group Was Training to Kill Obama, Clinton, Soros", "The Indica vs. Sativa Distinction Isn’t Real", "How John Roberts Is Shaping the Court’s Newly Savage Death Penalty Jurisprudence", "How Does the Comedy Cellar’s Owner Do His Job?", "Help! My Sister and I Planned to Share a Wedding Dress. Now She Hates It and Wants Me to Pay for It.", "Garry Kasparov Talks Trump and the Mueller Report With Yascha Mounk", "A Game of Thrones Investigation: What Is Giant’s Milk Really Like?", "Help! My Wife and I Agreed I Would Get Pregnant With Our Next Kid, but Now I Don’t Want To.", "Elizabeth Warren’s Plan to Forgive Student Debt Is Smart Politics and Decent Policy", "Organizers of the Google Walkout Say They’ve Been Threatened With Demotion", "The Mueller Report Makes It Clear: Trump Is Off the Hook in SDNY as Well", "Why There Won’t Be Any Expeditions to the North Pole This Year", "Why Does It Always Take a Crisis to Get Something Fixed?", "Don McGahn Is No Hero", "How Does It Feel to Be the First Black Woman to Lead the Harvard Crimson?", "Jimmy Fallon Got the Cast of Avengers: Endgame to Recap the Films of the MCU to the Tune of Billy Joel’s “We Didn’t Start The Fire.”", "Militias Posted Videos, Fundraised Through Facebook for Months", "Stop Saying We Have 12 Years Left to Address Climate Change", "My mother is telling my little sister that I essentially stole money from them.", "Why Conservatives Are So Angry About Obama’s Reference to “Easter Worshippers”", "Why Does Robert Caro Continue to Overlook Lyndon Johnson’s Virulent Misogyny?", "Nearly All Infants Lose Weight After They’re Born. So Why Do Hospitals Focus on It So Obsessively?", "Meet the Formerly Incarcerated Secretary of Pennsylvania’s Board of Pardons", "HBO Orders Armando Iannucci’s New Hugh Laurie Outer Space Tourism Comedy Avenue 5 to Series", "Some of the 2020 Dems Should Really Be Giving a Lot More to Charity", "This Week’s Worst Person in Westeros: The Racist Girls of Winterfell", "Dear Prudence Uncensored: The Flirtatious Neighbor", "Mueller Clearly Thinks Trump Could Be Charged Once He’s Out of Office", "Help! My Dad Lied About a Secret Loan He Took Out and Now Expects Me to Pay It Off.", "Leader of Right-Wing Border Militia Allegedly Said the Group Was Training to Assassinate Obama, Clinton, and Soros", "A New Trove of Civil Rights–Era Tapes Shows How White Supremacy Branded Itself as Respectable", "With Her Sex Scene, Arya Reclaimed Her Humanity", "Warren’s Plan to Forgive Student Debt Is Smart Politics and Decent Policy", "I’m a Gay Man, and My Student Is Homophobic. What Should I Do?", "Help! My Husband Says He Is “Done” With Going Out.", "A New Trove of Civil Rights–Era Tapes Shows How White Supremacy Began to Brand Itself as Respectable", "When You Give Birth, Your Body … Rips. That Might Suck a Little Less if We Talked About It More.", "What Is Giant’s Milk Really Like? An Investigation.", "The Inspecting Our Own Meat Edition", "What Does “Accountability” Mean to House Democratic Leaders?", "Herman Cain Says He Is Not Actually Withdrawing His Name From the Fed Race", "Drone Pilots Deserve Privacy Too", "Dear Care and Feeding: My 6-Year-Old Lies All the Time", "The Census Case Is a Test of Whether the Truth Still Matters at the Supreme Court", "Game of Thrones’ Controversial Sex Scene Gave Arya Back Her Humanity", "So Is Impeachment Plausible, Necessary, or Stupid?"]}, {"date": "datetime.datetime(2019, 4, 24, 14, 55, 30, 80696)", "titles": ["Game of Thrones Is Throwing Daenerys Targaryen Under the Bus", "Sometimes It Takes a Horrible Fire to Raise a Billion Dollars", "The Most Effective Tick Repellents for Humans (and Dogs), According to Science", "One of the Most Incredible Buzzer-Beaters in NBA History Happened Tuesday and It Is Going to Inspire a Lot of Future Airballs", "Years Ago, Black Feminists Worked Together to Unmask Twitter Trolls Posing as Women of Color. If Only More People Paid Attention.", "No Wonder the White House Is Fighting McGahn’s Subpoena. His Testimony Could Be Fatal.", "Tuesday’s Incredible Buzzer-Beater Is Going to Inspire a Lot of Future Airballs", "How Does the Comedy Cellar’s Owner Do His Job?", "The Inspecting Our Own Meat Edition", "Elizabeth Warren’s Plan to Forgive Student Debt Is Smart Politics and Decent Policy. Will Anyone Care?", "Supreme Court Justices Consider the Latest Republican Power Grab: the U.S. Census", "Little Co-Writer Says She Didn’t Write That Transphobic Joke", "The Supreme Court Is Poised to Trash Its Reputation to Help Trump Rig the Census", "Puerto Rico Should Become Ground Zero for the Green New Deal", "Herman Cain Says He Decided to Pull Out of the Fed Race Because It Would Be a Pay Cut. LOL.", "Future Tense Newsletter: Twinkle, Twinkle, Little Ad", "My 20-Year-Old Refuses to Get a Summer Job", "Mueller Proved Comey Told the Truth", "Sally Rooney’s Books Are Not Just 19th-Century Novels in H&M Outfits", "Here’s What’s Disappearing From Netflix in May", "Help! My Husband Says He Is “Done” With Going Out.", "What It’s Like to DM With Russian Hackers", "Even Space Isn’t Safe From Ads", "The Daily Show’s Roy Wood Jr. Has the Only MCU Recap You Need", "Raising Kids in Germany Is Wildly Cheap. Just Look at What This Family With Twins Spends in a Week.", "What’s Going On With the Teenager Suing Apple Over Facial Recognition Technology?", "How Does It Feel to Be the First Black Woman to Lead the Harvard Crimson?", "Trevor Noah Weighs Warren’s Policies Against Buttigieg’s Charm", "My 6-Year-Old Lies All the Time. Should I Worry?", "Dear Care and Feeding: My 20-Year-Old Just Takes Our Money and Refuses to Get a Summer Job", "How Evolution Has Wired Us for Good", "Trump’s Fed Pick Stephen Moore: Critics Are “Pulling a Kavanaugh Against Me”", "The Never-Ending CNN Town Hall", "Herman Cain Says He Is Not Actually Withdrawing His Name From the Fed Race", "Don’t Panic if Your Baby Hasn’t Started Walking Yet", "How Do I Get My 5-Year-Old to Eat Anything Other Than Cereal?", "Saudi Arabia Carries Out Mass Execution of 37 People in a Day", "The Black Feminists Who Saw the Alt-Right Threat Coming", "When You Give Birth, Your Body … Rips. That Might Suck a Little Less if We Talked About It More.", "Hanif Abdurraqib Offers a Final Tribute to Phife Dawg, the Heart of A Tribe Called Quest", "This Nonprofit Wants to Offer Political Campaigns Free Protection From Hackers. Here’s the Catch.", "Homecoming Anchors Beychella in Black History", "Drone Pilots Deserve Privacy Too", "Mueller Proved Lyin’ Comey Did Not Lie. Guess Who Did.", "Charged: Criminogenic", "The Supreme Court Is Poised to Shred Its Credibility to Let Trump Rig the Census", "Trump Hauls Twitter CEO Jack Dorsey to the Oval Office, Wants to Know Why He Doesn’t Have More Twitter Followers", "Nearly All Infants Lose Weight After Birth. So Why Do Hospitals Obsess Over It?", "What a Married Mom Saved on Her Kids by Moving From New York to Germany", "Dear Prudence Podcast: Help! My Sister Thinks She’s a Genius Because of an Online Quiz.", "Game of Thrones’ Controversial Sex Scene Gave Arya Back a Little Bit of Her Humanity", "Help! My Sister and I Planned to Share a Wedding Dress. Now She Hates It and Wants Me to Pay for It.", "Kim Dumps Trump, Goes Cahootin’ With Putin", "Trevor Noah Weighs Elizabeth Warren’s Policies Against Pete Buttigieg’s Charm", "My mother is telling my little sister that I essentially stole money from them.", "Some of the 2020 Dems Should Really Be Giving a Lot More to Charity", "Help! My Boyfriend Expects Me to Move Back Home, but I Don’t Want To!"]}, {"date": "datetime.datetime(2019, 4, 24, 20, 55, 30, 80696)", "titles": ["Game of Thrones Is Throwing Daenerys Targaryen Under the Bus", "Sometimes It Takes a Horrible Fire to Raise a Billion Dollars", "The Most Effective Tick Repellents for Humans (and Dogs), According to Science", "One of the Most Incredible Buzzer-Beaters in NBA History Happened Tuesday and It Is Going to Inspire a Lot of Future Airballs", "Years Ago, Black Feminists Worked Together to Unmask Twitter Trolls Posing as Women of Color. If Only More People Paid Attention.", "No Wonder the White House Is Fighting McGahn’s Subpoena. His Testimony Could Be Fatal.", "Tuesday’s Incredible Buzzer-Beater Is Going to Inspire a Lot of Future Airballs", "How Does the Comedy Cellar’s Owner Do His Job?", "The Inspecting Our Own Meat Edition", "Elizabeth Warren’s Plan to Forgive Student Debt Is Smart Politics and Decent Policy. Will Anyone Care?", "Supreme Court Justices Consider the Latest Republican Power Grab: the U.S. Census", "Little Co-Writer Says She Didn’t Write That Transphobic Joke", "The Supreme Court Is Poised to Trash Its Reputation to Help Trump Rig the Census", "Puerto Rico Should Become Ground Zero for the Green New Deal", "Herman Cain Says He Decided to Pull Out of the Fed Race Because It Would Be a Pay Cut. LOL.", "Future Tense Newsletter: Twinkle, Twinkle, Little Ad", "My 20-Year-Old Refuses to Get a Summer Job", "Mueller Proved Comey Told the Truth", "Sally Rooney’s Books Are Not Just 19th-Century Novels in H&M Outfits", "Here’s What’s Disappearing From Netflix in May", "Help! My Husband Says He Is “Done” With Going Out.", "What It’s Like to DM With Russian Hackers", "Even Space Isn’t Safe From Ads", "The Daily Show’s Roy Wood Jr. Has the Only MCU Recap You Need", "Raising Kids in Germany Is Wildly Cheap. Just Look at What This Family With Twins Spends in a Week.", "What’s Going On With the Teenager Suing Apple Over Facial Recognition Technology?", "How Does It Feel to Be the First Black Woman to Lead the Harvard Crimson?", "Trevor Noah Weighs Warren’s Policies Against Buttigieg’s Charm", "My 6-Year-Old Lies All the Time. Should I Worry?", "Dear Care and Feeding: My 20-Year-Old Just Takes Our Money and Refuses to Get a Summer Job", "How Evolution Has Wired Us for Good", "Trump’s Fed Pick Stephen Moore: Critics Are “Pulling a Kavanaugh Against Me”", "The Never-Ending CNN Town Hall", "Herman Cain Says He Is Not Actually Withdrawing His Name From the Fed Race", "Don’t Panic if Your Baby Hasn’t Started Walking Yet", "How Do I Get My 5-Year-Old to Eat Anything Other Than Cereal?", "Saudi Arabia Carries Out Mass Execution of 37 People in a Day", "The Black Feminists Who Saw the Alt-Right Threat Coming", "When You Give Birth, Your Body … Rips. That Might Suck a Little Less if We Talked About It More.", "Hanif Abdurraqib Offers a Final Tribute to Phife Dawg, the Heart of A Tribe Called Quest", "This Nonprofit Wants to Offer Political Campaigns Free Protection From Hackers. Here’s the Catch.", "Homecoming Anchors Beychella in Black History", "Drone Pilots Deserve Privacy Too", "Mueller Proved Lyin’ Comey Did Not Lie. Guess Who Did.", "Charged: Criminogenic", "The Supreme Court Is Poised to Shred Its Credibility to Let Trump Rig the Census", "Trump Hauls Twitter CEO Jack Dorsey to the Oval Office, Wants to Know Why He Doesn’t Have More Twitter Followers", "Nearly All Infants Lose Weight After Birth. So Why Do Hospitals Obsess Over It?", "What a Married Mom Saved on Her Kids by Moving From New York to Germany", "Dear Prudence Podcast: Help! My Sister Thinks She’s a Genius Because of an Online Quiz.", "Game of Thrones’ Controversial Sex Scene Gave Arya Back a Little Bit of Her Humanity", "Help! My Sister and I Planned to Share a Wedding Dress. Now She Hates It and Wants Me to Pay for It.", "Kim Dumps Trump, Goes Cahootin’ With Putin", "Trevor Noah Weighs Elizabeth Warren’s Policies Against Pete Buttigieg’s Charm", "My mother is telling my little sister that I essentially stole money from them.", "Some of the 2020 Dems Should Really Be Giving a Lot More to Charity", "Help! My Boyfriend Expects Me to Move Back Home, but I Don’t Want To!"]}, {"date": "datetime.datetime(2019, 4, 24, 21, 54, 12, 322557)", "titles": ["White Supremacist Executed for Racially Motivated 1998 Murder That Changed How Hate Crimes Are Prosecuted", "Even Space Isn’t Safe From Ads", "Herman Cain Says He Decided to Pull Out of the Fed Race Because It Would Be a Pay Cut. LOL.", "Do You Want to Buy a Murder Bird? Here Is Our Advice.", "Elizabeth Warren’s Plan to Forgive Student Debt Is Smart Politics and Decent Policy. Will Anyone Care?", "Help! My Sister and I Planned to Share a Wedding Dress. Now She Hates It and Wants Me to Pay for It.", "What It’s Like to DM With Russian Hackers", "What a Married Mom Saved on Her Kids by Moving From New York to Germany", "Hanif Abdurraqib Offers a Final Tribute to Phife Dawg, the Heart of A Tribe Called Quest", "How Does the Comedy Cellar’s Owner Do His Job?", "Sometimes It Takes a Horrible Fire to Raise a Billion Dollars", "How Does It Feel to Be the First Black Woman to Lead the Harvard Crimson?", "Homecoming Anchors Beychella in Black History", "My 20-Year-Old Just Sits Around Playing D&D. Is There a Spell to Make This Chump Get a Job?", "Help! My Husband Says He Is “Done” With Going Out.", "Stephen Moore Might Be a Slimebag, but Let’s Not Forget That His Economic Ideas Are Terrible Too", "Here’s What’s Disappearing From Netflix in May", "Raising Kids in Germany Is Wildly Cheap. Just Look at What This Family With Twins Spends in a Week.", "Facebook Expects Government Fine for Data Breaches to Be 100 Times Larger Than Previous High for a Tech Company", "This Nonprofit Wants to Offer Political Campaigns Free Protection From Hackers. Here’s the Catch.", "The Inspecting Our Own Meat Edition", "How Do I Get My 5-Year-Old to Eat Anything Other Than Cereal?", "Herman Cain Says He Is Not Actually Withdrawing His Name From the Fed Race", "Waiting for Thanos", "The White House Will Fight McGahn Subpoena Because His Public Testimony Could Be a Knockout Blow", "Facebook Just Hired the Co-Author of the Patriot Act and An Advocate Who Helped Fight It", "Trump’s DHS Pardon Promise Is As Serious As Anything in the Mueller Report", "What’s Going On With the Teenager Suing Apple Over Facial Recognition Technology?", "Tuesday’s Incredible Buzzer-Beater Is Going to Inspire a Lot of Future Airballs", "Game of Thrones Is Throwing Daenerys Targaryen Under the Bus", "Dear Care and Feeding: My 20-Year-Old Just Takes Our Money and Refuses to Get a Summer Job", "Future Tense Newsletter: Twinkle, Twinkle, Little Ad", "Why Did Britney Spears Have to Confirm She’s Not Being Held Hostage?", "The Supreme Court Is Poised to Shred Its Credibility to Let Trump Rig the Census", "Facebook Just Hired the Patriot Act’s Co-Author and an Advocate Who Fought It", "Dear Prudence Podcast: Help! My Sister Thinks She’s a Genius Because of an Online Quiz.", "Avengers: Endgame Is Like Samuel Beckett in Space!", "Do You Want to Buy a Murder Bird?", "Why Parents Panic Way Too Much Over Kids Who Learn to Walk Late", "The Most Effective Tick Repellents for Humans (and Dogs), According to Science", "My 6-Year-Old Lies All the Time. Should I Worry?", "My mother is telling my little sister that I essentially stole money from them.", "John Roberts Should Be Terrified of the Lasting Damage His Court’s Census Decision Could Do", "A Personal Final Tribute to Phife Dawg", "Why So Many Democrats Are Running in 2020: They Don’t Think  Biden Can Win", "The Angle: What Would Daenerys Targaryen Think About the Citizenship Question?", "One of the Most Incredible Buzzer-Beaters in NBA History Happened Tuesday and It Is Going to Inspire a Lot of Future Airballs", "Trevor Noah Weighs Elizabeth Warren’s Policies Against Pete Buttigieg’s Charm", "Trump’s Fed Pick May Be a Slimebag, but Don’t Forget His Ideas Are Awful, Too", "The Census Case Will Define the Roberts Court", "Don’t Panic if Your Baby Hasn’t Started Walking Yet", "The 2020 Candidates Smell Blood", "Puerto Rico Should Become Ground Zero for the Green New Deal", "Help! My Boyfriend Expects Me to Move Back Home, but I Don’t Want To!", "Trump’s Pardon Promise Is As Serious As Anything in the Mueller Report", "One Reason So Many Democrats Are Running for President: They Don’t Think Joe Biden Can Win", "Joe Biden Sits On An Electable Part of the Political Spectrum. But It’ll Take a Lot More Than That to Win the Democratic Nomination."]}, {"date": "datetime.datetime(2019, 4, 25, 17, 14, 20, 571135)", "titles": ["Olivia Munn’s Bizarre Vendetta", "Why Many Democrats Fell for Michael Avenatti’s Schtick", "What a Married Mom of Twins Spends on Her Kids During a Week in Biberach an der Riss, Germany", "Even Space Isn’t Safe From Ads", "Why Do Republicans Want an Inaccurate Census?", "Stephen Moore Might Be a Slimebag, but Let’s Not Forget That His Economic Ideas Are Terrible Too", "I Recommend Sonically Cleansing Your Face", "The Mueller Report Questions Congress Should Ask William Barr Next Week", "Olivia Munn’s Bizarre Vendetta Against One of the Least-Mean Fashion Sites on the Internet", "My Kid Was Given a Morbid Assignment. What Is This Teacher Thinking?", "Washington Set to Be the First State to Allow the Composting of Human Bodies", "Do You Want to Buy a Murder Bird?", "Waiting for Thanos", "The Inspecting Our Own Meat Edition", "What Joe Biden’s Diagnosis of Trump Gets Wrong", "Why Did Britney Spears Have to Confirm She’s Not Being Held Hostage?", "Herman Cain Says He Decided to Pull Out of the Fed Race Because It Would Be a Pay Cut. LOL.", "Beyoncé’s Dad Is Developing a Destiny’s Child Stage Musical From His Perspective", "Facebook Just Hired the Co-Author of the Patriot Act and An Advocate Who Helped Fight It", "Elizabeth Warren’s Plan to Forgive Student Debt Is Smart Politics and Decent Policy. Will Anyone Care?", "Justice Department Indicts the Judge Who Helped an Immigrant Evade ICE in Her Courthouse", "Help! My Dad Lied About a Secret Loan He Took Out and Now Expects Me to Pay It Off.", "Why Britney Spears Had to Confirm She’s Not Being Held Hostage", "Dear Care and Feeding: My 20-Year-Old Just Takes Our Money and Refuses to Get a Summer Job", "The Roberts Court Is Considering the Legal Reasoning of Jim Crow to Uphold a Rigged Census", "9 Chefs on Their Favorite Sea Salts", "He confessed he still had feelings for one of them a month before he proposed.", "What the Black Feminists Who First Fought Misinformation Online Can Teach Us", "Why Parents Panic Way Too Much Over Kids Who Learn to Walk Late", "Future Tense Newsletter: Twinkle, Twinkle, Little Ad", "My 4-Year-Old Is Obsessed With Her Looks, on Slate’s Parenting Podcast", "Sometimes It Takes a Horrible Fire to Raise a Billion Dollars", "The Government’s Social Media Block Isn’t Helping", "This Nonprofit Wants to Offer Political Campaigns Free Protection From Hackers. Here’s the Catch.", "The Social Media Block Isn’t Helping Sri Lanka", "The Press Didn’t Just Report Accurately on Trump-Russia Corruption, It Prevented the Corruption From Being Worse", "I Highly Recommend Sonically Cleansing Your Face", "Ask a Teacher: My Child Was Assigned the Worst School Project Ever. What Should I Do?", "How a Myth About the Endgame in Chess Seduced Pop Culture", "Dear Prudence Uncensored: The Cruel Co-Worker and Kids", "What It’s Like to DM With Russian Hackers", "I Am Donald Trump’s Star on the Hollywood Walk of Fame and I’ve Seen Enough. It’s Time for Impeachment.", "Herman Cain Says He Is Not Actually Withdrawing His Name From the Fed Race", "Hanif Abdurraqib Offers a Final Tribute to Phife Dawg, the Heart of A Tribe Called Quest", "How Does the Comedy Cellar’s Owner Do His Job?", "A Punk, a Writer, and a Cop Poet", "Here’s What’s Disappearing From Netflix in May", "Help! My Boyfriend Expects Me to Move Back Home, but I Don’t Want To!", "How Does It Feel to Be the First Black Woman to Lead the Harvard Crimson?", "All the Dems Running See Biden’s Lead, and They Smell Blood", "Dear Prudence Podcast: Help! My Sister Thinks She’s a Genius Because of an Online Quiz.", "My 6-Year-Old Lies All the Time. Should I Worry?", "Report: North Korea Demanded $2 Million From the U.S. for Otto Warmbier’s Medical Care", "The 2020 Candidates Smell Blood", "How a Myth About the Endgame in Chess Seduced Avengers, GOT, and More", "The Angle: Don’t Count Joe Biden Out", "SCOTUS Is Considering Jim Crow’s Legal Justification to Uphold a Rigged Census"]}, {"date": "datetime.datetime(2019, 4, 26, 12,18, 24, 959842)", "titles": ["Black Feminists Saw Extremist Trolls Coming—and Fought Back", "Do You Want to Buy a Murder Bird?", "The 2020 Candidates Smell Blood", "Why Parents Panic Way Too Much Over Kids Who Learn to Walk Late", "The Giants’ Pick Literally Had People Laughing on the Air", "What Should We Do About the Past Crimes of Reformed Hackers?", "Herman Cain Says He Decided to Pull Out of the Fed Race Because It Would Be a Pay Cut. LOL.", "My 6-Year-Old Lies All the Time. Should I Worry?", "What the Black Feminists Who First Fought Misinformation Online Can Teach Us", "40 Gifts for Every Type of Mom", "Think You’re Smarter Than a Slate Politics Writer? Find Out With This Week’s News Quiz.", "Jack Dorsey Called Rep. Omar to Explain Why Twitter Won’t Take Down the 9/11 Video Trump Tweeted Out of Her", "Dear Prudence Uncensored: The Cruel Co-Worker and Kids", "How Does the Comedy Cellar’s Owner Do His Job?", "Forgetting the Recent History of Climate Change Politics", "Even Space Isn’t Safe From Ads", "Washington Set to Be the First State to Allow the Composting of Human Bodies", "Stephen Moore Might Be a Slimebag, but Let’s Not Forget That His Economic Ideas Are Terrible Too", "Taylor Swift’s “ME!” Is Filled With Rainbows, Kittens, and Unicorns. It’s a Trap.", "The Phenomenon of the Posthumous Hit", "Dear Care and Feeding: I Do Not Want to Be Sloppily Kissed on the Lips by My 7-Year-Old", "I Can’t Afford Doggy Day Care Anymore. What Will My Pup Need if I Cut Back?", "How Does It Feel to Be the First Black Woman to Lead the Harvard Crimson?", "A Casual Moviegoer’s Guide to Endgame", "A Casual Moviegoer’s Guide to Avengers: Endgame", "Should I Believe a Guy Who Claims He’s, Um, Huge?", "Olivia Munn’s Bizarre Vendetta Against One of the Least-Mean Fashion Sites on the Internet", "Think You’re Smarter Than a Senior Politics Writer?", "Why Preet Bharara’s Glad That He Didn’t Return Donald Trump’s Calls", "Facebook Just Hired the Co-Author of the Patriot Act and An Advocate Who Helped Fight It", "Olivia Munn’s Bizarre Vendetta Against One of the Internet’s Least-Mean Fashion Sites", "Have I Been Totally Duped About Penis Size My Entire Life?", "The Inspecting Our Own Meat Edition", "A Definitive Ranking of the Avengers’ New Hairstyles in Endgame", "“ME!” Is Filled With Rainbows, Kittens, and Unicorns. It’s a Trap.", "The Roberts Court Is Considering the Legal Reasoning of Jim Crow to Uphold a Rigged Census", "Elizabeth Warren’s Student Loan Forgiveness Plan Mostly Helps the Middle Class, Think Tank Finds", "Daniel Jones Is the Answer for the Giants. (The Question: “What Pick Will Make Everyone Laugh at Us”?)", "Watch Fox News’ Legal Analyst Call Trump’s Obstruction “Immoral, Criminal, Defenseless, and Condemnable”", "Legal Analyst Calls Trump’s Obstruction “Immoral, Criminal, Defenseless, and Condemnable”", "Slate Spoiler Specials: Avengers: Endgame", "Kentucky Governor Blames Shooting of 7-Year-Old on Teacher Protests", "The Social Media Block Isn’t Helping Sri Lanka", "Trump Doesn’t Want a “Better” Deal With Iran. He Just Wants to Punish It, No Matter the Cost.", "Sometimes It Takes a Horrible Fire to Raise a Billion Dollars", "Help! My Boyfriend Expects Me to Move Back Home, but I Don’t Want To!", "Future Tense Newsletter: Twinkle, Twinkle, Little Ad", "Fox News’ Legal Analyst Called Trump’s Obstruction “Immoral, Criminal, Defenseless, and Condemnable”", "Avengers: Endgame Is a Love Letter to Robert Downey Jr.", "Ask a Teacher: My Child Was Assigned the Worst School Project Ever. What Should I Do?", "How a Myth About the Endgame in Chess Seduced Avengers, GoT, and More", "This Nonprofit Wants to Offer Political Campaigns Free Protection From Hackers. Here’s the Catch.", "He confessed he still had feelings for one of them a month before he proposed.", "Dear Prudence Podcast: Help! My Sister Thinks She’s a Genius Because of an Online Quiz.", "Joe Biden Called Anita Hill Before Launching His Campaign. She’s Not Ready to Forgive Him.", "Elizabeth Warren’s Plan to Forgive Student Debt Is Smart Politics and Decent Policy. Will Anyone Care?", "Taylor Swift Resurrects “the Old Taylor,” but Did She Ever Really Leave?", "Help! My Dad Lied About a Secret Loan He Took Out and Now Expects Me to Pay It Off."]}, {"date": "datetime.datetime(2019, 4, 26, 17, 36, 55, 628121)", "titles": ["A Widely Cited Statistic That Supposedly Proved Student Debt Was a Rich Person Problem Was the Result of a Coding Error", "I May Have Missed Some of the Marvel Movies and Just Finished Watching Avengers: Endgame and I Have Questions!", "How Does It Feel to Be the First Black Woman to Lead the Harvard Crimson?", "Taylor Swift’s “ME!” Is Filled With Rainbows, Kittens, and Unicorns. It’s a Trap.", "The Inspecting Our Own Meat Edition", "Slate Spoiler Specials: Avengers: Endgame", "Elizabeth Warren’s Plan to Forgive Student Debt Is Smart Politics and Decent Policy", "The Giants’ Pick Literally Had People Laughing on the Air", "The Worst Moment in Endgame Is the One That’s Supposed to Be the Most Feminist", "Trump Defends His “Very Fine People on Both Sides” Remark: I Was Talking About Robert E. Lee Fans", "Taylor Swift Resurrects “the Old Taylor”", "The View’s Gushing Hosts Saved Biden From Embarrassing Himself in His First Campaign Interview", "Widely Cited Statistic Supposed to Prove Student Debt Was a Rich Person Problem Was Wrong", "The Social Media Block Isn’t Helping Sri Lanka", "Washington Set to Be the First State to Allow the Composting of Human Bodies", "He confessed he still had feelings for one of them a month before he proposed.", "Wikipedia’s Refusal to Profile a Black Female Scientist Shows Its Diversity Problem", "Do You Want to Buy a Murder Bird?", "Dear Prudence Podcast: Help! My Sister Thinks She’s a Genius Because of an Online Quiz.", "Biden Has Successfully Goaded Trump, Which Is Exactly What He Needs to Do", "I Do Not Want to Be Sloppily Kissed on the Lips by My 7-Year-Old", "Elizabeth Warren’s Student Loan Forgiveness Plan Mostly Helps the Middle Class, Think Tank Finds", "Dear Prudence Uncensored: The Cruel Co-Worker and Kids", "Dear Care and Feeding: I Do Not Want to Be Sloppily Kissed on the Lips by My 7-Year-Old", "Help! My Boyfriend Expects Me to Move Back Home, but I Don’t Want To!", "Trevor Noah Assesses Joe Biden, Trump’s Least Favorite Candidate", "My 6-Year-Old Lies All the Time. Should I Worry?", "Ask a Teacher: My Child Was Assigned the Worst School Project Ever. What Should I Do?", "Olivia Munn’s Bizarre Vendetta Against One of the Least-Mean Fashion Sites on the Internet", "Why Parents Panic Way Too Much Over Kids Who Learn to Walk Late", "Avengers: Endgame’s Feminist Moment Is Too Little, Too Patronizing, Too Late", "Should I Believe a Guy Who Claims He’s, Um, Huge?", "The Supreme Court’s Anti-Worker Rulings Are So Routine Now That We Hardly Notice Them. Big Mistake.", "This Nonprofit Wants to Offer Political Campaigns Free Protection From Hackers. Here’s the Catch.", "What the Black Feminists Who First Fought Misinformation Online Can Teach Us", "Herman Cain Says He Decided to Pull Out of the Fed Race Because It Would Be a Pay Cut. LOL.", "40 Gifts for Every Type of Mom", "What Should We Do About the Past Crimes of Reformed Hackers?", "Texas Retracts Claim of Mass Voter Fraud Touted by Trump, Agrees to Halt Planned Purge", "Have I Been Totally Duped About Penis Size My Entire Life?", "Rod Rosenstein Has Adopted Trumpian Talking Points", "Help! My Dad Lied About a Secret Loan He Took Out and Now Expects Me to Pay It Off.", "The Angle: Kansas Is Paving the Way to Preserving Roe v. Wade", "An Attack on “Colorblind” College Admissions Might Backfire Against the Harvard Case", "Even Space Isn’t Safe From Ads", "I Can’t Afford Doggy Day Care Anymore. What Will My Pup Need if I Cut Back?", "Which Game of Thrones Characters Will Die in the Battle of Winterfell?", "How Does the Comedy Cellar’s Owner Do His Job?", "Ukraine Elected a Sitcom Star President. His Show Tells Us What to Expect.", "Facebook Just Hired the Co-Author of the Patriot Act and An Advocate Who Helped Fight It", "Think You’re Smarter Than a Senior Politics Writer?", "Which Game of Thrones Characters Will Die in the Battle of Winterfell?", "Stephen Moore Might Be a Slimebag, but Let’s Not Forget That His Economic Ideas Are Terrible Too"]}, {"date": "datetime.datetime(2019, 4, 27, 15, 47, 53, 578953)", "titles": ["What Will It Be Like to Vacation on Mars? Author Indra Das Discovers the Hazards and Beauty of Interplanetary Tourism in a New Short Story.", "Stephen Moore Might Be a Slimebag, but Let’s Not Forget That His Economic Ideas Are Terrible Too", "Biden Wants the Female Vote Without Having to Earn It", "Do You Want to Buy a Murder Bird?", "10 Questions Joe Biden Needs to Answer About His Views on Race", "I May Have Missed Some of the Marvel Movies and Just Finished Watching Avengers: Endgame and I Have Questions!", "Which Game of Thrones Characters Will Die in the Battle of Winterfell?", "Dear Prudence Uncensored: The Cruel Co-Worker and Kids", "Taylor Swift’s “ME!” Is Filled With Rainbows, Kittens, and Unicorns. It’s a Trap.", "What We’ll Hear on Mars", "All the Confusing Parts, Explained for Non-Super Fans", "Biden Has Successfully Goaded Trump, Which Is Just What He Needs to Do", "My 7-Year-Old Daughter Is a Very Sloppy Kisser", "What Is Gender and, in Particular, Womanhood?", "I try to suppress it, but it’s like suppressing a sneeze.", "A Widely Cited Statistic That Supposedly Proved Student Debt Was a Rich Person Problem Was the Result of a Coding Error", "Ukraine Elected a Sitcom Star President. His Show Tells Us What to Expect.", "Help! My Boyfriend Expects Me to Move Back Home, but I Don’t Want To!", "The Goop Face Oil Edition", "I Highly Recommend Sonically Cleansing Your Face", "SCOTUS’s Pro-Corporate Rulings Are So Predictable, No One Notices Them Anymore", "Taylor Swift Resurrects “the Old Taylor,” but Did She Ever Really Leave?", "Wikipedia’s Refusal to Profile a Black Female Scientist Shows Its Diversity Problem", "How Does It Feel to Be the First Black Woman to Lead the Harvard Crimson?", "What Should We Do About the Past Crimes of Reformed Hackers?", "A New Obstruction Case Against a Judge Proves William Barr’s DOJ Is Now Just an Arm of President Donald Trump", "Trump Again Re-Enacts Paris Terror Attacks Using Finger Guns: “Get Over Here! Boom!”", "Elizabeth Warren’s Plan to Forgive Student Debt Is Smart Politics and Decent Policy", "Help! My Dad Lied About a Secret Loan He Took Out and Now Expects Me to Pay It Off.", "40 Gifts for Every Type of Mom", "Biden Has Successfully Goaded Trump, Which Is Exactly What He Needs to Do", "10 Questions Biden Needs to Answer About His Views on Race", "The Worst Moment in Endgame Is the One That’s Supposed to Be the Most Feminist", "Why Parents Panic Way Too Much Over Kids Who Learn to Walk Late", "I Can’t Afford Doggy Day Care Anymore. What Will My Pup Need if I Cut Back?", "Herman Cain Says He Decided to Pull Out of the Fed Race Because It Would Be a Pay Cut. LOL.", "The View’s Gushing Hosts Saved Biden From Embarrassing Himself", "The Best Natural Cleaning Products, According to Experts", "Dear Care and Feeding: I Do Not Want to Be Sloppily Kissed on the Lips by My 7-Year-Old", "Even Space Isn’t Safe From Ads", "How Does the Comedy Cellar’s Owner Do His Job?", "The U.K.’s Crisis Is Giving Euroskeptics Pause", "Texas Retracts Claim of Mass Voter Fraud Touted by Trump, Agrees to Halt Planned Purge", "Trevor Noah Assesses Joe Biden, Trump’s Least Favorite Candidate", "Slate Spoiler Specials: Avengers: Endgame", "Elizabeth Warren’s Student Loan Forgiveness Plan Mostly Helps the Middle Class, Think Tank Finds", "Help! I Involuntarily Orgasm Every Time I Get a Massage.", "Sam Donaldson: Sarah Sanders Deserves “Lifetime Achievement Oscar for Lying”", "What Determines Whether You Trust Climate Change, Vaccines, Or Evolutionary Science? Often, It’s The People Around You.", "Kansas Court’s Sweeping Abortion Decision Will Protect Roe Despite SCOTUS", "A Definitive Ranking of the Heroes’ New Hairstyles", "President Praises Second Pick in NFL Draft, a Trump Supporter Who Called Kaepernick a “Clown”", "The Fight for LGBTQ Protections Under the Civil Rights Act", "Trump Re-Enacts Paris Attacks With Finger Guns: “Get Over Here! Boom!”", "Washington Set to Be the First State to Allow the Composting of Human Bodies", "The Social Media Block Isn’t Helping Sri Lanka", "Dear Prudence Podcast: Help! My Sister Thinks She’s a Genius Because of an Online Quiz."]}, {"date": "datetime.datetime(2019, 4, 29, 12, 36, 37, 668162)", "titles": ["John Oliver Is Feuding With a Giant Otter Who Wears a Turtle as a Hat", "The Affordable Cream That Brightens and Conceals My Under-Eye Circles", "The Goop Face Oil Edition", "What We’ll Hear on Mars", "Rockets-Warriors Was All About One Specific Type of Foul", "Ian McEwan Should Read Some Science Fiction", "Country Bans All Face Veils After Easter Bombings", "A Definitive Ranking of the Heroes’ New Hairstyles", "Attorney General Barr Threatens to Cancel House Testimony on Mueller Report Amid Format Dispute", "Woman Killed in California Synagogue Was Shot While Protecting Rabbi", "The Social Media Block Isn’t Helping Sri Lanka", "Spain’s Anti-Immigrant, Anti-Feminist Party Did Worse Than Expected but Could Still Transform the Country’s Politics", "The Worst Scene in Endgame", "Why Parents Panic Way Too Much Over Kids Who Learn to Walk Late", "Elizabeth Warren’s Plan to Forgive Student Debt Is Smart Politics and Decent Policy", "Dear Prudence Uncensored: The Cruel Co-Worker and Kids", "Co-Workers Should Not Be Forced to Share Hotel Rooms", "Even Space Isn’t Safe From Ads", "How Does the Comedy Cellar’s Owner Do His Job?", "Endgame Is a Love Letter to Robert Downey Jr. From the Marvel Cinematic Universe", "Looking to Pinterest for Teacher Gift Inspiration? Think Again.", "Herman Cain Says He Decided to Pull Out of the Fed Race Because It Would Be a Pay Cut. LOL.", "Dear Prudence Podcast: Help! My Sister Thinks She’s a Genius Because of an Online Quiz.", "A Widely Cited Statistic That Supposedly Proved Student Debt Was a Rich Person Problem Was the Result of a Coding Error", "Hate-Filled Letter Posted Online Claims to Be From Synagogue Shooting Suspect", "Why Parents Shouldn’t Fret Over the World Health Organization’s New Screen Time Guidelines", "Joe Biden Wants Women to Vote for Him", "A “Nice” Guy Suddenly Said Awful Things to Me During Sex", "What’s It Like to MC at the Comedy Cellar?", "All the Mildly Confusing Parts, Explained for Non-Super Fans", "Horror Stories That Prove Co-Workers Should Not Have to Share a Hotel Room", "I try to suppress it, but it’s like suppressing a sneeze.", "Why You Couldn’t See a Damn Thing in This Week’s Game of Thrones", "Why You Couldn’t Actually See Any of Game of Thrones’ Epic Battle Scene", "Help! My Boyfriend Expects Me to Move Back Home, but I Don’t Want To!", "This Week’s Worst Person in Westeros: The Night King", "What Should We Do About the Past Crimes of Reformed Hackers?", "Wikipedia’s Refusal to Profile a Black Female Scientist Shows Its Diversity Problem", "Inside the Crisis at the NRA", "A “Nice” Guy Suddenly Said Awful Things to Me During Sex. Is This Normal?", "Elizabeth Warren’s Student Loan Forgiveness Plan Mostly Helps the Middle Class, Think Tank Finds", "Hate-Filled Letter Posted Online Claims to Be From Suspect", "I Grew Up in a Dysfunctional Family. How Can I Learn to Be a Good Father?", "Help! My Fiancé Wants to Invite His Two Former Lovers to Our Wedding.", "To Understand the Dating Apps of Today, It Helps to Look at a VHS Tape From 1987", "Dear Care and Feeding: How Do I Learn to Be a Good Father?", "10 Questions Joe Biden Needs to Answer About His Views on Race", "Stephen Moore Might Be a Slimebag, but Let’s Not Forget That His Economic Ideas Are Terrible Too", "Sri Lanka Bans all Face Veils After Easter Bombings", "Who Was the Worst Person in Westeros This Week?", "What Will It Be Like to Vacation on Mars? Author Indra Das Discovers the Hazards and Beauty of Interplanetary Tourism in a New Short Story.", "Ian McEwan Is So Ignorant About Sci-Fi, He Thinks His A.I. Novel Is Groundbreaking", "Let Sleeping Co-Workers Lie", "Ocasio-Cortez Accuses Kellyanne Conway of Trying to “Stoke Suspicion Around My Christianity”", "Real Teachers Dish on What They Actually Want for Teacher Appreciation Week", "My 7-Year-Old Daughter Is a Very Sloppy Kisser", "Trump: After Birth, Baby Is “Wrapped” in a Blanket and Mother, Doctor Decide Whether to “Execute the Baby”"]}, {"date": "datetime.datetime(2019, 4, 30, 10, 15, 49, 557952)", "titles": ["The Best Bike Locks, According to Cycling Experts", "My Wife Won’t Have Sex Anymore, so I Go to Erotic Massage Parlors", "This Week’s Worst Person in Westeros: The Night King", "What Should We Do About the Past Crimes of Reformed Hackers?", "Wikipedia’s Refusal to Profile a Black Female Scientist Shows Its Diversity Problem", "Here’s Why the Dothraki Attack in Game of Thrones Was So Devastating", "A Widely Cited Statistic That Supposedly Proved Student Debt Was a Rich Person Problem Was the Result of a Coding Error", "Trying to Restore Voting Rights to Prisoners Hurts More Than It Helps", "Stephen Moore Might Be a Slimebag, but Let’s Not Forget That His Economic Ideas Are Terrible Too", "Rod Rosenstein, the Man Responsible for the Mueller Investigation, Resigns", "She is not a good wife! What do I do?", "Sen. Richard Lugar Quietly Saved the World", "The Goop Face Oil Edition", "What Teachers Actually Want From Student Gifts", "Right Wing Smear Campaigners Try to Cook Up Fake Sexual Assault Accusations Against Pete Buttigieg", "Mormon College Kids Aren’t Known for Their Protests. But They’re Protesting Now.", "“Smart” Technology Is Coming for Prisons, Too", "Why the Dothraki Attack Was So Devastating", "Dear Prudence Uncensored: The Cruel Co-Worker and Kids", "Help! My Fiancé Wants to Invite His Two Former Lovers to Our Wedding.", "What We’ll Hear on Mars", "Why Game of Thrones’ Biggest Battle Was a Thrilling Disappointment", "Young Adults on Their Parents’ Insurance Must Choose Between an HIV-Preventing Drug and Their Sexual Privacy", "What’s It Like to MC at the Comedy Cellar?", "Even Space Isn’t Safe From Ads", "Arya’s Destiny Has Been Foretold for Years. We Just Didn’t Know It.", "My Wife Won’t Have Sex, so I Frequent Erotic Massage Parlors. Should I Stop?", "How Much Does Team Bonding Matter When Fighting Fires?", "Joe Biden Wants Women to Vote for Him", "The Last Avengers Movie Posed Some Big Malthusian Questions. So Does the New One.", "Pinterest Has Ruined Teacher Presents", "Elizabeth Warren’s Plan to Forgive Student Debt Is Smart Politics and Decent Policy", "Help! Is It a Red Flag That My Boyfriend Keeps “Liking” Bikini Photos on Instagram?", "Why Parents Shouldn’t Fret Over the World Health Organization’s New Screen Time Guidelines", "Why Game of Thrones’ Biggest Battle Was Such a Thrilling Disappointment", "David Lynch’s MasterClass Is As Surreal and As Banal As You’d Expect", "Joe Biden Still Doesn’t Understand What He Did to Anita Hill", "A Novel for the Ages, Firmly Rooted in the Political Here and Now", "What Will It Be Like to Vacation on Mars? Author Indra Das Discovers the Hazards and Beauty of Interplanetary Tourism in a New Short Story.", "Trying to Restore the Vote to Prisoners Hurts More Than It Helps", "I Had a Dysfunctional Family. How Do I Learn to Be a Good Father?", "Rod Rosenstein Resigns. At Last.", "What Happened When a Young John Singleton Met a Young Spike Lee", "William Barr Is Cowering at the Prospect of a Proper Questioning", "Why You Couldn’t See a Damn Thing on This Week’s Game of Thrones", "Game of Thrones Taught Us to Want Death. Then It Changed the Rules.", "Help! I Involuntarily Orgasm Every Time I Get a Massage.", "Elizabeth Warren’s Student Loan Forgiveness Plan Mostly Helps the Middle Class, Think Tank Finds", "Fans Are Bummed More Characters Didn’t Die. What Is Wrong With Us?", "Why Trump Is Playing Tough Guy With the Saudis Now", "Kyler Murray Was the No. 1 Pick. Daniel Jones Is the Story of the NFL Draft.", "Hate-Filled Letter Posted Online Claims to Be From Synagogue Shooting Suspect", "The Simplest Way to Change a Beloved Teacher’s Life", "A “Nice” Guy Suddenly Said Awful Things to Me During Sex. Is This Normal?", "Help! I’m Having an Affair With My Best Friend. Should I Tell Him How Awful I Think His Wife Is?", "Dear Care and Feeding: How Do I Learn to Be a Good Father?", "Herman Cain Says He Decided to Pull Out of the Fed Race Because It Would Be a Pay Cut. LOL.", "Game of Thrones Tried to Make Arya’s Big Moment Both Surprising and Inevitable", "Why Parents Panic Way Too Much Over Kids Who Learn to Walk Late"]}, {"date": "datetime.datetime(2019, 5, 1, 10, 59, 46, 623032)", "titles": ["What Avengers: Endgame Understands About Grief", "Dear Prudence Uncensored: The Cruel Co-Worker and Kids", "Andy Richter Had a Different Avengers: Endgame Experience Than Most People", "Dear Care and Feeding: Can We Have Daytime Sex When Our Son’s in the House?", "She is not a good wife! What do I do?", "What’s It Like to Almost Beat Jeopardy’s Game-Changing Champion?", "Methodists Face a Tween-Led Split Over LGBTQ Policies", "Dear Prudence Podcast: Help! My Girlfriend and I Want to Be Monogamous Again. How Do We Dump Our Third?", "What Happens When You No Longer Want to Be the Man You Were Raised to Become?", "The iPhone’s Cutesy “Reactions” Are Ruining Group Texts. HA HA!", "The Navy Admits Something Weird Has Been Going On in the Skies", "Joe Biden Still Doesn’t Understand What He Did to Anita Hill", "Small Thrills, Big Disappointments", "Why the Dothraki Attack Was So Devastating", "Barr Implies Mueller Should Say Whether Trump Committed a Crime", "Congress Should Ask William Barr These Questions Today", "Why Parents Panic Way Too Much Over Kids Who Learn to Walk Late", "Should I Break Up With My Childless Friends?", "Elizabeth Warren’s Student Loan Forgiveness Plan Mostly Helps the Middle Class, Think Tank Finds", "Silicon Valley Is All for Big Government—Just Not on Their Turf", "The Goop Face Oil Edition", "Why Game of Thrones’ Biggest Battle Was Such a Thrilling Disappointment", "Why America Hasn’t Elected a Mayor as President in Almost 100 Years", "Trump’s Disgusting “Baby Execution” Lie Is Also Dangerously Effective as Propaganda", "Hate-Filled Letter Posted Online Claims to Be From Synagogue Shooting Suspect", "Sony Makes the Best Bluetooth Wireless Headphones", "Charged: The Ghost of Tyrone Howard", "The Best Movies and TV Shows Coming to Netflix, HBO, Amazon Prime, and Hulu in May", "Joseph Stiglitz on Progressive Capitalism", "William Barr’s Testimony Implies That Robert Mueller Should Say Whether Trump Committed a Crime", "Trump Just Gave Democrats Another Reason to Launch an Impeachment Inquiry", "What’s It Like to MC at the Comedy Cellar?", "How Art Museums Must Transform to Thrive in a Post–Hilma af Klint World", "The Army of the Living’s Battle Plan Wasn’t So Bad", "Why Parents Shouldn’t Fret Over the World Health Organization’s New Screen Time Guidelines", "Does Joe Biden Know How Much Power He Has?", "Trump Gave Dems a New Reason to Start Impeachment", "PewDiePie Disavowing a White Supremacist Meme Matters", "A Military Strategist Defends the Living Army’s Tactics in the Battle of Winterfell", "The Best Movies and TV Shows Coming to Streaming This Month", "Campus Shooting Spree at University North Carolina Charlotte Kills At Least Two, Critically Injures Three Others", "Pete Buttigieg Needs a Big Policy Idea. And I Have a Suggestion.", "Biden’s Boring, Conventional Campaign Is Just What Many Democratic Voters Want", "What’s Fact and What’s Fiction in Fosse/Verdon Episode 4", "A Widely Cited Statistic That Supposedly Proved Student Debt Was a Rich Person Problem Was the Result of a Coding Error", "Join Us for an Event About the Future of Slaughter-Free Meat", "Judge Rules Against Trump in Emoluments Suit", "Even Space Isn’t Safe From Ads", "Help! Is It a Red Flag That My Boyfriend Keeps “Liking” Bikini Photos on Instagram?", "What We’ll Hear on Mars", "I Had a Dysfunctional Family. How Do I Learn to Be a Good Father?", "How Much Does Team Bonding Matter When Fighting Fires?", "Here’s Why the Dothraki Attack in Game of Thrones Was So Devastating", "10 Questions Raised by the Sonic the Hedgehog Trailer", "Help! I Involuntarily Orgasm Every Time I Get a Massage.", "Why It’s a Big Deal That PewDiePie Disavowed a Meme Beloved by White Supremacists", "“Smart” Technology Is Coming for Prisons, Too"]}, {"date": "2019-05-07 14:27:06.794572", "titles": ["San Francisco Is About to Be the First U.S. City to Ban Police From Using Facial Recognition Tech", "Get Rid of Your Lawn", "Real Teachers Dish on What They Actually Want for Teacher Appreciation Week", "Nobody Wants to Run for Senate", "Why Jokes About the Royal Baby’s “Unusual,” “Unifying,” and Unknown Name Were So Satisfying", "What Do We Do First if We Spot an Asteroid Hurtling Toward Earth?", "Turkish Government Orders Revote After Istanbul Election Rebukes Erdogan", "Pete Buttigieg Needs a Big Policy Idea. And I Have a Suggestion.", "Help! My Sister Doesn’t Think My Gay Daughter Deserves the Family Heirloom.", "Your sister sounds like she’s begging for an estrangement.", "Hang Up and Listen: The Kawhi Gets the Last Laugh Edition", "Oh Good, a Subway System Is Making Riders Stare at Ads Before They Can Buy Tickets", "My Baby Suffered a Febrile Seizure, and I’m Not Sure I Did the Right Thing", "Why Video Therapy Is Such a Great Alternative to In-Person Therapy", "About That Disposable Coffee Cup", "What’s It Like to Book the Comedy Cellar?", "Georgia Just Criminalized Abortion. Women Who Terminate Their Pregnancies Would Be Subject to Life in Prison.", "This Week’s Game of Thrones Episode Featured a Disposable Coffee Cup, and the Internet Is Not Having It", "The Legend of the Vomelet", "Dear Care and Feeding: Am I Allowed to Join a Church Just to Get Into Its Day Care?", "Dear Prudence Uncensored: The Parenting Problem", "Game of Thrones TV Club: The One With the Starbucks Cup", "Help! My Nephew Stole $4,000 From My Business. Now He Wants a Good Reference.", "Critics Complain That Free College Wouldn’t Be Progressive. They’re Missing the Point.", "Stephen Moore—Whose Fed Bid Is Crashing and Burning—Wanted to Get Rid of Child Labor Laws", "With Smarter Living, the New York Times Is Making an Old Bet on Service Journalism", "Congress Had a Hearing on the ERA Last Week. (Hold for Gasps.)", "Janelle Monáe Will Reimagine Lady and the Tramp’s Racist Siamese Cat Song", "I’ve Only Ever Had Sex With My Wife. Am I Missing Anything?", "Seth Meyers Investigates Trump’s Friendly Phone Call with Putin", "Why Facebook’s Latest Ban of Alex Jones and Company Was So Underwhelming", "Caster Semenya’s Case Could Keep Getting Uglier", "Why Jokes About the UNUSUAL and UNIFYING Royal Baby Name Were So Satisfying", "Ending Pregnancies in Georgia Will Soon Get Women Life in Prison", "At the Met Gala, Camp Proved Elusive as Ever. But It Was Fun to Watch the Chase.", "I Married the Only Woman I’ve Slept With. Now I Want to Know What I Missed Out On.", "The GoT TV Club Discusses Episode 4 and the Problem With Tyrion", "Why Is Visibility Such an Important Part of Leadership?", "Vampire Weekend’s New Album Is Their Least Cool and Maybe Their Best", "Delivery Drones Will Bring With Them Incessant Mechanical Buzzing", "New NRA President Says Georgia Democrat Only Won Her Seat in Congress Because She’s Black", "Hasan Minhaj’s YouTube Videos for Patriot Act Are As Funny As His Show—and Much Weirder", "Help! My Family Loves to Hug. I Hate It.", "The Fashions Weren’t All Campy, but They Sure Were Fun", "Joseph Stiglitz on Progressive Capitalism", "Gentrification Got Gentrified", "The White House Is Planning a Backdoor Travel Ban on Trump’s “S—thole Countries”", "Trump Pardons Soldier Convicted of Killing Iraqi Prisoner", "We Didn’t Circumcise My Son", "A Subway System Is Making Riders Watch Ads Before They Can Buy a Ticket", "Every Single Thing We Know About This New Royal Baby", "A Closer Look at Euron Greyjoy’s Big, Big Gun", "Slate Money: The Eat a Hamburger Edition", "Help! I’m in a Happy Relationship With My Boyfriend, but I Still Want to Date Women."]}, {"date": "2019-05-08 10:38:48.616687", "titles": ["Watch Conan O’Brien Slowly Lose Interest in a Joke He’s Rehearsing", "To Understand Male Loneliness, Just Look at the Friendships of Boys", "The Honesty and Optimism of Knock Down the House", "Joseph Stiglitz on Progressive Capitalism", "Dear Prudence Uncensored: The Parenting Problem", "Democrats Should Never Have Pinned Their Hopes on Don McGahn", "Critics Complain That Free College Wouldn’t Be Progressive. They’re Missing the Point.", "Who Wins When Branches of Government Battle it Out?", "The Democrats Will Never Learn That Shame Isn’t Enough", "Your sister sounds like she’s begging for an estrangement.", "R.I. Students Who Owe Lunch Money Can Only Get Jelly Sandwiches", "Dear Care and Feeding: My Smart, Independent Daughter Wears Halter Tops and Short Shorts to School", "Help! My Nephew Stole $4,000 From My Business. Now He Wants a Good Reference.", "Is Lab-Grown Meat Really So Revolutionary?", "San Francisco Is About to Be the First U.S. City to Ban Police From Using Facial Recognition Tech", "Tweet Like Magic Johnson and Make Twitter a Better Place", "John Bolton Is Leading Donald Trump (and the Rest of Us) Into Conflicts in Iran, Venezuela, and North Korea", "We’re Finally Starting to Realize the End of the Earth Means the End of Us", "Help! I’m in a Happy Relationship With My Boyfriend, but I Still Want to Date Women.", "It’s Finally Sinking In That the End of Earth Means the End of Us", "This Little Brewer Makes Idiotproof Pour-Over Coffee", "The Show Has Finally Admitted Who It Prefers to Win", "The Uber Strike Could Be Painful for the Company. Here’s How to Tell if It’s Working.", "Oh Good, a Subway System Is Making Riders Stare at Ads Before They Can Buy Tickets", "Pete Buttigieg Needs a Big Policy Idea. And I Have a Suggestion.", "John Bolton’s Dream World", "School District in Rhode Island to Serve Students Who Owe Lunch Money Only Jelly Sandwiches", "Slate Money: The Eat a Hamburger Edition", "Barcelona Cakewalks Into Champions League … Wait, What? Liverpool Won?!?", "The Trump Administration Wants to Muck With the Poverty Line, Making It Harder for Poor People to Get Food Stamps", "Bolton Is Leading Us Into Conflicts in Iran, Venezuela, and North Korea", "Georgia Just Criminalized Abortion. Women Who Terminate Their Pregnancies Would Be Subject to Life in Prison.", "Stolen Credit Card Numbers Are Now Worth About $15 Each Online", "Charged: The Escape Hatch", "Knotweed Can’t Be Killed. But Can It Be Stopped?", "What’s Fact and What’s Fiction in Fosse/Verdon Episode 5", "Game of Thrones Has Finally Admitted It Prefers Jon to Dany", "Is Daenerys Doomed to Become the Mad Queen on Game of Thrones?", "The New York Times Has 10 Years of Gnarly Tax Documents Showing Trump to Be a Mirage of a Man", "The NYT Got 10 Years of Trump’s Gnarly Tax Documents", "I Married the Only Woman I’ve Slept With. Now I Want to Know What I Missed Out On.", "Should I Settle for a Less Expensive Day Care Center?", "With Smarter Living, the New York Times Is Making an Old Bet on Service Journalism", "Nancy Pelosi Thinks Avoiding Impeachment Is the Safe Play. It’s Actually Quite Risky.", "The College Admissions Scandal Is Becoming a TV Series", "How the British Tabloids Are Covering the Royal Baby in the Absence of Pretty Much Any Real Information", "At the Met Gala, Camp Proved Elusive as Ever. But It Was Fun to Watch the Chase.", "When Beverly Hills Is Worried About “Gentrification,” It’s Time to Finally Define the Term", "One of the Greatest Comebacks in Soccer History", "How to Tell if the Uber Strike Is Working", "Male Loneliness Starts in Boyhood", "Why Is Visibility Such an Important Part of Leadership?", "Dear Prudence Podcast: Help! How Do I Deal With a Racist—but Popular—Mom at My Kid’s School?", "Democrats Shouldn’t Have Pinned Their Hopes on McGahn", "How Tabloids Cover the Royal Baby When There’s No News About the Royal Baby", "Caster Semenya’s Case Could Keep Getting Uglier", "We Didn’t Circumcise My Son. Will Girls Reject Him?", "To Understand the Cause of Male Loneliness, Just Look at the Friendships of Boys", "What’s It Like to Book the Comedy Cellar?"]}, {"date": "2019-05-09 12:44:43.778584", "titles": ["We Didn’t Circumcise My Son. Will Girls Reject Him?", "Archie Harrison Mountbatten-Windsor Is a Terrific Name for This Royal Baby", "Ask a Teacher: How Can I Be Sure My School Takes Gun Threats Seriously?", "Knotweed Can’t Be Killed. But Can It Be Stopped?", "Why Is Visibility Such an Important Part of Leadership?", "When Beverly Hills Is Worried About “Gentrification,” It’s Time to Finally Define the Term", "Sepp Blatter Still Really Wants the Watches He Left at FIFA Back", "Delivery Bots Could Make Cities More Accessible for Everyone", "Wait, You Can Still Get the Plague?", "Dear Prudence Uncensored: The Family Portrait", "Critics Complain That Free College Wouldn’t Be Progressive. They’re Missing the Point.", "What’s It Like to Book the Comedy Cellar?", "Netflix Is Making an Interactive Unbreakable Kimmy Schmidt Episode", "Democrats Should Troll Trump Over His $1 Billion in Business Losses From Now Until Eternity", "Baltimore’s Top Official Resigned in Disgrace", "WikiLeaks Is Not a Wiki", "Help! My Fiancé’s Cat Might Tear Our Family Apart.", "How Caster Semenya’s Case Became the Flashpoint in a Debate About Sports and Sex", "An Ode to My Friends’ Moms, Who Helped Me Imagine Being a Grown-Up", "A Texas High School Wants a Dress Code for Parents. Guess What Kind of Parents.", "Nancy Pelosi’s Gamble", "“Whose Poor Daughter Are You?”", "Oh, No, Not Knotweed!", "Help! My Sister Doesn’t Think My Gay Daughter Deserves the Family Heirloom.", "Trump Laughs Off Supporter’s Suggestion to Shoot Migrants at Border", "What We Do in the Shadows Just Staged the Greatest Celebrity Vampire Reunion of All Time", "His fiancée wanted to know how much I was going to give them for the wedding.", "A Texas High School Wants a Dress Code for Parents. Guess What Kind of Parents It Targets.", "The Ride-Hail Strike Got Just Enough Attention to Terrify Uber", "The Trump Administration Wants to Muck With the Poverty Line, Making It Harder for Poor People to Get Food Stamps", "Help! My Future Sister-in-Law Insists I Pay for Her Reception and Honeymoon", "Dear Care and Feeding: My Smart, Independent Daughter Wears Halter Tops and Short Shorts to School", "Donald Trump Lost a Billion Dollars—Just Not His Own", "Trust Pelosi. She’s Right About 2020 and Impeachment.", "Who Makes The Gist?", "Trump Didn’t Personally Lose a Billion Dollars", "Trust Pelosi", "My Daughter Witnessed a Gun Threat, but Her Teacher Denies It", "With Detective Pikachu, the Neo-Noir Genre Finally Gets Its Pokémon", "Dear Prudence Podcast: Help! How Do I Deal With a Racist—but Popular—Mom at My Kid’s School?", "Trump Laughs Off Supporter’s Suggestion to Shoot Migrants at the Border", "Denver Becomes First U.S. City to Vote to Decriminalize Magic Mushrooms", "Every TV Character Suddenly Writes for the Internet. Which Show Gets It Right?", "The Coat", "Future Tense Newsletter: Body Politic(s)", "All the Championship Teams That Have Skipped Visits to the Trump White House", "Slate Money: The Eat a Hamburger Edition", "Google Is Making a Powerful Change in Its Devices", "Let Detective-Turned–Aerobics Dancer Pikachu Brighten Your Day", "Pelosi Is Outwitting Republicans Without Impeachment Talk", "The Daily Show Went Through Tapes of Bernie Sanders’ Old Public Access Show and He Hasn’t Changed a Bit", "Early Libertarian Dreams of a Free Internet Didn’t Work Out as Planned"]}, {"date": "2019-05-10 12:15:18.493688", "titles": ["HUD: Proposed Trump Rule Could Evict More Than 55,000 Children From Public Housing", "Rachel Held Evans’ Radical Christianity Accepted Everyone", "Students Walk Out of Vigil for Victim Because It Felt Like a “Political Stunt”", "Help! My Sister Doesn’t Think My Gay Daughter Deserves the Family Heirloom.", "Alexa Is Both Friend and Sales Robot. That’s a Problem.", "Google Is Making a Powerful Change in Its Devices", "What’s It Like to Book the Comedy Cellar?", "When Beverly Hills Is Worried About “Gentrification,” It’s Time to Finally Define the Term", "The Directors Discuss Their Film’s Biggest Twists", "HUD: New Rule Could Evict 55,000 Children From Public Housing", "The Day My Mom Got Me a Great Deal on a Coat", "My Friends’ Moms Helped Me Imagine Being a Grown-Up. Now I Want to Be Like Them.", "29 Last-Minute Gifts That Will Arrive by Mother’s Day", "Rockets-Warriors Is an Incomprehensible Mess of Confusing Storylines and Bad Basketball", "My Puppy Always Spills Her Water Bowl and Splashes Around. How Can I Get Her to Drink Up?", "Are We in a Constitutional Crisis?", "Oh, No, Not Knotweed!", "The Essential Question for Game of Thrones’ Endgame", "2001: A Space Odyssey: Just What Do You Think You’re Doing, Dave?", "Dear Prudence Uncensored: The Family Portrait", "The Coat", "Democrats Are Maybe Starting to Find the Right Balance on Impeachment", "Why Is Visibility Such an Important Part of Leadership?", "We Didn’t Circumcise My Son. Will Girls Reject Him?", "Critics Complain That Free College Wouldn’t Be Progressive. They’re Missing the Point.", "Democrats Are Maaaaaaybe Starting to Find the Right Balance on the Tricky Politics of Impeachment", "His fiancée wanted to know how much I was going to give them for the wedding.", "Dear Care and Feeding: My Mother-in-Law Is Secretly Planning to Circumcise Our Son", "The Russo Brothers’ Pitch Before Directing Marvel Movies? In the Comics, Captain America Kind of Sucks.", "The Same Things That Made Game of Thrones Great Make It Impossible for It to End Well", "Rockets-Warriors Is a Mess of Confusing Storylines and Bad Basketball", "How Nancy Pelosi Can Expose Trump and Barr’s Extraordinary Power Grab", "The Same Things That Made Game of Thrones Great Will Make Its Ending Disappointing", "Chelsea Manning Released From Jail After 62 Days", "Slate Spoiler Specials: Detective Pikachu", "The Trump Administration Wants to Muck With the Poverty Line, Making It Harder for Poor People to Get Food Stamps", "Wait, You Can Still Get the Plague?", "Help! My Fiancé’s Cat Might Tear Our Family Apart.", "My Daughter Tells Me Every Detail of Her Sex Life. I Do Not Want to Hear It.", "The Directors of Avengers: Endgame on Its Biggest Twists", "Yikes, My Daughter Won’t Stop Telling Me Every Detail of Her Sex Life", "Donald Trump Lost a Billion Dollars—Just Not His Own", "Think You’re Smarter Than Mark Joseph Stern? Find Out With This Week’s News Quiz.", "Future Tense Newsletter: Body Politic(s)", "Dear Prudence Podcast: Help! How Do I Deal With a Racist—but Popular—Mom at My Kid’s School?", "The Ride-Hail Strike Got Just Enough Attention to Terrify Uber", "WikiLeaks Is Not a Wiki", "I Can Finally Wear Dangly Earrings Again Because of These Clear Stickers", "Why Aren’t “Good” Husbands Pulling Their Weight in the House?", "Here Is Tom Hanks Doing the 2001: A Space Odyssey Theme A Cappella", "Think You’re Smarter Than Mark Joseph Stern?", "Nancy Pelosi’s Gamble", "Breaking Up Facebook Won’t Fix Its Speech Problems", "Democrats Should Troll Trump Over His $1 Billion in Business Losses From Now Until Eternity", "Slate Money: The Eat a Hamburger Edition"]}, {"date": "2019-05-11 19:03:19.141910", "titles": ["National Teacher of the Year Rodney Robinson on How He Teaches—and Actually Reaches—Kids in Juvenile Detention", "Wine Country Is So Busy Avoiding Clichés It Forgets to Be Funny", "My Daughter Tells Me Every Detail of Her Sex Life. I Do Not Want to Hear It.", "Slate Spoiler Specials: Detective Pikachu", "Dear Prudence Uncensored: The Family Portrait", "Help! I Found Child Porn on My Fiancé’s Computer, but I’m Afraid to Report Him.", "Breaking Up Facebook Won’t Fix Its Speech Problems", "Where Does Political Power Lie? Robert Caro Has Spent Nearly 50 Years Searching for the Answer.", "I Can Finally Wear Dangly Earrings Again Because of These Clear Stickers", "Donald Trump Didn’t Personally Lose a Billion Dollars", "The Teacher of the Year on Why There Are So Few Black, Male Teachers", "Leaked Documents Allege the NRA Has Been Spending $100,000 a Day on Lawyers", "Critics Complain That Free College Wouldn’t Be Progressive. They’re Missing the Point.", "Are We in a Constitutional Crisis?", "A Guide to the Ideas That Have Made Elizabeth Warren 2020’s Biggest Wonk", "Democrats Should Troll Trump Over His $1 Billion in Business Losses From Now Until Eternity", "Dear Prudence Podcast: Help! How Do I Deal With a Racist—but Popular—Mom at My Kid’s School?", "Help! My Fiancé’s Cat Might Tear Our Family Apart.", "Constance Wu Seems Unhappy That ABC Renewed Fresh Off the Boat", "Uber Was Designed to Isolate Drivers. That’s Why the Strike Was a Triumph.", "The Coat", "The $5 Sticky Wax That Keeps My Candles From Toppling Over", "An Empty, Edenic “Frontier” Was a Core Lie of American History. So Why is David McCullough Still Peddling It?", "The Daily Show Examines Sexism in Media Coverage of Female Candidates", "Wait, You Can Still Get the Plague?", "Alexa Is Both Friend and Sales Robot. That’s a Problem.", "Report: Trump Has “Taken Charge” of Washington’s Fourth of July Celebration", "What Does CBD Do? Mostly, It’s Just Expensive.", "What’s It Like to Book the Comedy Cellar?", "How the Left and the Right Could Unite to Fix World Poverty", "Help! My Sister Doesn’t Think My Gay Daughter Deserves the Family Heirloom.", "The Warriors Haven’t Gotten Tired of Destroying the Rockets’ Souls", "The Gist’s Mike Pesca Answers Burning Questions From Slate Staff", "The Day My Mom Got Me a Bargain on a Coat—and the Long, Unforgettable Talk That Followed", "What Kind of Gender Nonconformity Does the Public Really Fear?", "Joe Biden Has Turned the Narrative Around the 2020 Democratic Primary Totally Upside Down", "I Married the First Woman I Slept With. Have I Missed Out on Something?", "A Few Words From a Member of the Third Branch", "Donald Trump Could Have Waged a Smart Trade War or a Dumb One. Guess Which He Chose.", "An Ode to “the Moms”", "A Georgia State Senator Explains the New Law That Would Imprison Women Who Get Abortions", "The Trump Administration Wants to Muck With the Poverty Line, Making It Harder for Poor People to Get Food Stamps", "WikiLeaks Is Not a Wiki", "Google Is Making a Powerful Change in Its Devices", "Larry Wilmore on Criticism in the Land of the Woke", "What Do We Call It When the Rich Displace the Middle Class?", "Slate Money Celebrates Its Fifth Birthday", "My Puppy Always Spills Her Water Bowl and Splashes Around", "D.C. Author May Lose Book Deal After Reporting a Black Metro Employee for Eating on the Train", "Author May Lose Book Deal After Reporting a Black D.C. Metro Employee for Eating on the Train", "The Ride-Hail Strike Got Just Enough Attention to Terrify Uber", "I am worried that, based on sharing a computer, I could also be held responsible should I report him.", "Oh, No, Not Knotweed!"]}, {"date": "2019-05-12 19:39:26.627959", "titles": ["Google Is Making a Powerful Change in Its Devices", "What Does CBD Do? Mostly, It’s Just Expensive.", "The Ride-Hail Strike Got Just Enough Attention to Terrify Uber", "Alexa Is Both Friend and Sales Robot. That’s a Problem.", "This SNL Sketch With Emma Thompson Will Change the Way You Watch Beauty and the Beast", "Author May Lose Book Deal After Reporting Black D.C. Metro Worker for Eating on Train", "WikiLeaks Is Not a Wiki", "Help! I Found Child Porn on My Fiancé’s Computer, but I’m Afraid to Report Him.", "What Kind of Gender Nonconformity Does the Public Really Fear?", "Democrats Should Troll Trump Over His $1 Billion in Business Losses From Now Until Eternity", "Dear Prudence Podcast: Help! How Do I Deal With a Racist—but Popular—Mom at My Kid’s School?", "The Trump Administration Wants to Muck With the Poverty Line, Making It Harder for Poor People to Get Food Stamps", "Wine Country Is So Busy Avoiding Clichés It Forgets to Be Funny", "How Does CBD Make You Feel, Really?", "Knotweed Can’t Be Killed. But Can It Be Stopped?", "Single Moms Spend Less Time on Chores Than Married Moms. I’m Not Surprised!", "Larry Kudlow Admits U.S. Businesses and Consumers Pay for China Tariffs", "Report: Trump Has “Taken Charge” of Washington’s Fourth of July Celebration", "Peggy Lipton, Star of The Mod Squad and Twin Peaks, Has Died at 72", "These Empire Gifs Are Perfect for Every Situation", "Leaked Documents Allege the NRA Has Been Spending $100,000 a Day on Lawyers", "To Understand the Cause of Male Loneliness, Just Look at the Friendships of Boys", "Uber Was Designed to Isolate Drivers. That’s Why the Strike Was a Triumph.", "What’s It Like to Book the Comedy Cellar?", "Slate Money Celebrates Its Fifth Birthday", "The Warriors Haven’t Gotten Tired of Destroying the Rockets’ Souls", "The Coat", "Larry Wilmore on Criticism in the Land of the Woke", "I Married the First Woman I Slept With. Have I Missed Out on Something?", "I am worried that, based on sharing a computer, I could also be held responsible should I report him.", "Breaking Up Facebook Won’t Fix Its Speech Problems", "Critics Complain That Free College Wouldn’t Be Progressive. They’re Missing the Point.", "Donald Trump Could Have Waged a Smart Trade War or a Dumb One. Guess Which He Chose.", "Dear Prudence Uncensored: The Family Portrait", "Help! My Sister Doesn’t Think My Gay Daughter Deserves the Family Heirloom.", "This Saturday Night Live Sketch With Emma Thompson Will Change the Way You Watch Beauty and the Beast", "The Day My Mom Got Me a Great Deal on a Coat—and the Long, Unforgettable Talk That Followed", "Report: Trump Has “Taken Charge” of D.C.’s Fourth of July Celebration", "Help! My Fiancé’s Cat Might Tear Our Family Apart.", "Constance Wu Seems Unhappy That ABC Renewed Fresh Off the Boat", "Trump Knocks Former White House Counsel Don McGahn", "What Do We Call It When the Rich Displace the Middle Class?", "Single Moms Spend Less Time on Chores Than Married Ones. Don’t I Know It.", "Trump Says It Was McGahn, Not Mueller, He Really Wanted to Fire", "The Legend of the Vomelet, the Absolute Worst Food in the Military", "The $5 Sticky Wax That Keeps My Candles From Toppling Over", "Oh, No, Not Knotweed!", "This Sketch With Emma Thompson Will Change How You See Beauty and the Beast", "Warren Has Earned Her Wonk Reputation", "There’s No Such Thing as a “Dream Job”", "D.C. Author May Lose Book Deal After Reporting a Black Metro Employee for Eating on the Train", "Report: Internal documents show how the Pentagon wants to fund the border wall.", "Donald Trump Didn’t Personally Lose a Billion Dollars", "Wait, You Can Still Get the Plague?", "An Empty, Edenic “Frontier” Was a Core Lie of American History. So Why is David McCullough Still Peddling It?"]}, {"date": "2019-05-13 11:32:31.724533", "titles": ["I Think My Husband Masturbates With His Best Friend", "The Alleged Massacre on Last Night’s Game of Thrones Means U.S. Aid to Westeros Is More Important Than Ever", "This Week’s Worst Person in Westeros: Daenerys Targaryen", "Dear Prudence Uncensored: The Family Portrait", "Uber Was Designed to Isolate Drivers. That’s Why the Strike Was a Triumph.", "Horror Stories That Prove the “Dream Job” Is a Myth", "I am worried that, based on sharing a computer, I could also be held responsible should I report him.", "I Married the First Woman I Slept With. Have I Missed Out on Something?", "The Ride-Hail Strike Got Just Enough Attention to Terrify Uber", "Help! My Sister Doesn’t Think My Gay Daughter Deserves the Family Heirloom.", "WikiLeaks Is Not a Wiki", "There’s No Such Thing as a “Dream Job”", "Please Stop Joking About How Angry You Are I Lost the Baby Weight", "C.J. McCollum Had All the Answers for Portland in Game 7", "Royal Baby Baby Toes!", "C.J. McCollum Made Game 7 Look Easy", "Slate Money Celebrates Its Fifth Birthday", "Wine Country Is So Busy Avoiding Clichés It Forgets to Be Funny", "Dear Care and Feeding: How Do I Get People to Stop Joking About How Angry They Are I Lost the Baby Weight?", "What Do We Call It When the Rich Displace the Middle Class?", "Democrats Should Troll Trump Over His $1 Billion in Business Losses From Now Until Eternity", "Who Are Package-Free Stores For?", "David McCullough’s Narrow Chronicle of the “Frontier” Glorifies a Core Lie of U.S. History", "Dear Prudence Podcast: Help! How Do I Deal With a Racist—but Popular—Mom at My Kid’s School?", "John Oliver Tries to Make Carbon Pricing As Thrilling As Game of Thrones’ Coffee Cup", "Breaking Up Facebook Won’t Fix Its Speech Problems", "Linda Taylor Committed Abhorrent Crimes. She Became a Legend for the Least of Them.", "Donald Trump Didn’t Personally Lose a Billion Dollars", "Sweden Reopens Rape Case Against Julian Assange", "Should Gay Men Be Getting Anal Pap Smears?", "Donald Trump Could Have Waged a Smart Trade War or a Dumb One. Guess Which He Chose.", "Critics Complain That Free College Wouldn’t Be Progressive. They’re Missing the Point.", "Larry Kudlow Admits U.S. Businesses and Consumers Pay for China Tariffs", "How an Abortion Ban Exposed a Rift Among Alabama’s Republicans", "The Coat", "Trump Says It Was McGahn, Not Mueller, He Really Wanted to Fire", "The Only Thing CBD Oil Is Scientifically Proven to Do Is Not Why You Buy It", "Warren Has Earned Her Wonk Reputation", "On Earplugs", "I Think My Husband Masturbates With His Best Friend. How Do I, Um, Bring This Up?", "This SNL Sketch With Emma Thompson Will Change the Way You Watch Beauty and the Beast", "Help! My Fiancé’s Cat Might Tear Our Family Apart.", "Tidying Up With Marie Kondo Has Created a Flood of Clothing Donations No One Wants", "Trump Knocks Former White House Counsel Don McGahn", "Kawhi Leonard’s Absurd, Four-Bounce Buzzer-Beater Wins it For Toronto", "How to Buy Baby Gear Like an Economist: A Q&A With Author Emily Oster", "China Slaps New Tariffs on the U.S. Trump’s Plan to Deal With It Is Not Great", "A Series-Winning Miracle", "Report: Internal Documents Show How the Pentagon Wants to Fund the Border Wall", "Daenerys Targaryen Was This Week’s Worst Person in Westeros", "Oh, No, Not Knotweed!", "Alexa Is Both Friend and Sales Robot. That’s a Problem.", "The Trump Administration Wants to Muck With the Poverty Line, Making It Harder for Poor People to Get Food Stamps", "Package-Free Products Promise to Help the Planet, but Who Are They For?", "The Warriors Haven’t Tired of Destroying the Rockets’ Souls", "China Slaps New Tariffs on the U.S. and Trump’s Plan to Deal With It Is Not Great"]}]}